{
    "LAB1": [
        "книга",
        "комп’ютерна гра",
        "супермаркет",
        "банківська картка",
        "комп. програма",
        "аеропорт",
        "телевізор",
        "інтернет-сайт",
        "бібліотека",
        "потяг",
        "інтернет-магазин",
        "театр",
        "корабель",
        "аудиторія",
        "зоопарк",
        "ліки",
        "навчальний предмет",
        "кафе",
        "домашня тварина",
        "розклад занять",
        "аптека",
        "автомобіль",
        "операційна система",
        "університет",
        "планшет",
        "армійська частина",
        "лікарня",
        "термінал поповнення",
        "ютуб-канал",
        "школа",
        "відеокарта",
        "мобільний додаток",
        "магазин",
        "велосипед",
        "криптовалюта",
        "місто",
        "мобільний телефон",
        "магазин додатків",
        "країна",
        "гіроскутер",
        "кулінарна страва",
        "фабрика",
        "квадрокоптер",
        "студентська група",
        "банк",
        "відеокамера",
        "студент",
        "заповідник",
        "шафа",
        "оркестр",
        "туристична фірма",
        "рюкзак",
        "онлайн-бібліотека",
        "спортклуб",
        "верхній одяг",
        "банківський депозит",
        "парк",
        "музичний центр",
        "викладач",
        "музей",
        "розумний годинник",
        "спортсмен",
        "ресторан",
        "швейна машина",
        "програміст",
        "квартира",
        "літак",
        "екзамен",
        "ферма",
        "домашня рослина",
        "кінофільм",
        "автомагістраль",
        "музичний інструмент",
        "свято",
        "кінотеатр",
        "автобус",
        "пацієнт",
        "море",
        "планета",
        "оповідання",
        "спортивний майданчик",
        "ігрова консоль",
        "музичний колектив",
        "мережа магазинів",
        "ноутбук",
        "кіноактор",
        "будинок",
        "фотоапарат",
        "мікрорайон",
        "політична партія",
        "пляшка води",
        "кавоварка",
        "веб-браузер",
        "хмарне сховище",
        "піцерія",
        "концертний зал",
        "художня галерея",
        "ботанічний сад"
    ],
    "LAB3": [
        "музей",
        "інтернет-сайт",
        "банк",
        "бібліотека",
        "аптека",
        "комп’ютерна гра",
        "аеропорт",
        "спортклуб",
        "ферма",
        "будинок",
        "лікарня",
        "супермаркет",
        "місто",
        "ресторан",
        "школа",
        "курорт",
        "потяг",
        "країна",
        "фабрика",
        "планета",
        "армійська частина",
        "мікрорайон",
        "операційна система",
        "корабель",
        "порт",
        "олімпіада",
        "сонячна система",
        "вступна кампанія",
        "озеро",
        "мобільний телефон",
        "університет",
        "зоопарк",
        "театр",
        "кінотеатр",
        "магазин",
        "парк",
        "автомобіль",
        "літак",
        "велосипед",
        "книга",
        "комп'ютер",
        "квартира",
        "готель",
        "залізнична станція",
        "автобусна зупинка",
        "річка",
        "море",
        "гори",
        "ліс",
        "поле",
        "сад",
        "город",
        "ринок",
        "торговий центр",
        "кафе",
        "бар",
        "клуб",
        "стадіон",
        "басейн",
        "тренажерний зал",
        "перукарня",
        "салон краси",
        "автосервіс",
        "автомийка",
        "АЗС",
        "пошта",
        "поліцейський відділок",
        "пожежна частина",
        "дитячий садок",
        "коледж",
        "академія",
        "дослідницький інститут",
        "лабораторія",
        "офіс",
        "склад",
        "телестудія",
        "радіостанція",
        "видавництво",
        "друкарня",
        "концертний зал",
        "цирк",
        "планетарій",
        "обсерваторія",
        "заповідник",
        "національний парк",
        "ботанічний сад",
        "аквапарк",
        "луна-парк",
        "гірськолижний курорт",
        "пляж",
        "острів",
        "півострів",
        "континент",
        "галактика",
        "всесвіт",
        "програма лояльності",
        "соціальна мережа",
        "мобільний додаток",
        "операційна система",
        "база даних",
        "веб-сервер",
        "мережевий протокол",
        "алгоритм",
        "структура даних",
        "мова програмування",
        "компілятор",
        "інтерпретатор",
        "інтегроване середовище розробки",
        "система контролю версій",
        "фреймворк",
        "бібліотека програм",
        "API",
        "штучний інтелект",
        "машинне навчання",
        "нейронна мережа",
        "комп'ютерний зір",
        "обробка природної мови",
        "робототехніка",
        "дрон",
        "3D-принтер",
        "віртуальна реальність",
        "доповнена реальність",
        "блокчейн",
        "криптовалюта",
        "смарт-контракт",
        "інтернет речей (IoT)",
        "хмарні обчислення",
        "великі дані (Big Data)",
        "кібербезпека",
        "біоінформатика",
        "генетика",
        "медицина",
        "фармакологія",
        "хімія",
        "фізика",
        "астрономія",
        "геологія",
        "географія",
        "історія",
        "археологія",
        "філософія",
        "соціологія",
        "психологія",
        "економіка",
        "політологія",
        "юриспруденція",
        "мистецтво",
        "музика",
        "література",
        "архітектура",
        "дизайн",
        "мода",
        "кулінарія",
        "спорт",
        "туризм",
        "релігія"
    ],
    "LAB4_TASK1": [
        "На скільки треба зменшити або збільшити значення числа A, щоб квадрат зі стороною A приблизно дорівнював площі кола радіусом B?",
        "В якій чверті декартової площини знаходиться точка з координатами (A, B)?",
        "Чи є прямокутник, сторони якого мають розміри A та B, квадратом, прямокутником, відрізком (якщо A чи B дорівнюють нулю) або точкою (якщо A=B=0)?",
        "Що більше – A доларів, B євро чи A*B гривень (курс брати приблизний)?",
        "Що менше: –A, –B, A чи B?",
        "Чи належить точка з координатами (A, B) квадрату, центр якого знаходиться в точці (0, 0), а довжина сторони дорівнює 10?",
        "Чи дорівнює одне з чисел A чи B вашому дню, місяцю чи року народження?",
        "Чи належать роки, задані числами A і B, нашій ері, до нашої ери чи майбутньому?",
        "В чому більше байтів: в A кілобайтах чи в B мегабайтах (якщо обидва числа додатні)?",
        "Чи лежить точка з координатами (A, B) на одній із осей декартової площини?",
        "Чи перетинається коло радіусом 10, центр якого знаходиться в точці (A, B), з осями координат?",
        "Чи є точка з координатами (A, B) кутом квадрата, центр якого знаходиться в точці (0, 0)?",
        "Що більше – квадрат числа A, куб числа B чи добуток A*B?",
        "До якої з трьох точок на декартовій площині точка з координатами (A, B) знаходиться ближче – до точки (–15, 9), до точки (7, –10) чи до точки (–A, –B)?",
        "Чи є число A парним, а число B - непарним?",
        "Чи ділиться число A на B без остачі (якщо B не дорівнює 0)?",
        "Який знак має добуток A*B?",
        "Чи є хоча б одне з чисел A або B нульовим?",
        "Чи є обидва числа A і B додатними?",
        "Чи є обидва числа A і B від'ємними?",
        "Чи мають числа A і B однаковий знак?",
        "Чи є число A більшим за модуль числа B?",
        "Чи лежить точка (A, B) всередині одиничного кола з центром в (0,0)?",
        "Чи можна побудувати трикутник зі сторонами A, B та (A+B)/2 (якщо A, B > 0)?",
        "Що більше: A% від B чи B% від A (якщо A, B > 0)?",
        "Чи є рік A високосним?",
        "Чи є рік B високосним?",
        "Чи належить число A діапазону [0, 100]?",
        "Чи належить число B діапазону [-50, 50]?",
        "Що більше: площа квадрата зі стороною A чи площа прямокутника зі сторонами A/2 та 2*A (якщо A > 0)?",
        "Чи є середнє арифметичне чисел A і B цілим числом?",
        "Чи є число A простим (врахувати обмеження)?",
        "Чи є число B простим (врахувати обмеження)?",
        "Чи є сума A+B степенем двійки?",
        "Чи є різниця A-B степенем двійки?",
        "Що більше: A в степені B чи B в степені A (для невеликих додатних A, B)?",
        "Чи належить точка (A,B) першій або третій чверті?",
        "Чи належить точка (A,B) другій або четвертій чверті?",
        "Чи лежить точка (A,B) на прямій y=x?",
        "Чи лежить точка (A,B) на прямій y=-x?",
        "Чи лежить точка (A,B) на параболі y=x^2?",
        "Чи є відстань від точки (A,B) до початку координат меншою за 5?",
        "Чи є відстань від точки (A,B) до точки (1,1) більшою за 10?",
        "Що більше: периметр квадрата зі стороною A чи периметр кола радіусом A / (2*pi)?",
        "Чи є A факторіалом якогось невеликого цілого числа?",
        "Чи є B факторіалом якогось невеликого цілого числа?",
        "Чи є A числом Фібоначчі (для невеликих значень)?",
        "Чи є B числом Фібоначчі (для невеликих значень)?",
        "Чи можна розмістити квадрат зі стороною A всередині кола радіусом B?",
        "Чи можна розмістити коло радіусом A всередині квадрата зі стороною B?",
        "Чи дорівнює сума цифр числа A (якщо A ціле і невелике) числу B?",
        "Чи дорівнює добуток цифр числа A (якщо A ціле і невелике) числу B?",
        "Чи є A паліндромом (якщо A ціле)?",
        "Чи є B паліндромом (якщо B ціле)?",
        "Чи є A щасливим квитком (сума перших N/2 цифр дорівнює сумі останніх N/2 цифр)?",
        "Чи є B щасливим квитком?",
        "Чи можна представити A як суму двох квадратів?",
        "Чи можна представити B як суму двох квадратів?",
        "Чи можна представити A як суму двох простих чисел (гіпотеза Гольдбаха)?",
        "Чи можна представити B як суму двох простих чисел?",
        "Що більше: sin(A) чи cos(B) (якщо A, B в радіанах)?",
        "Що більше: log(A) чи exp(B) (для додатних A, B)?",
        "Чи знаходиться A градусів Цельсія вище за B градусів Фаренгейта?",
        "Чи знаходиться A кілометрів далі за B миль?",
        "Чи знаходиться A кілограмів важче за B фунтів?",
        "Чи є A метрів довше за B ярдів?",
        "Чи є A літрів більше за B галонів?",
        "Чи є A гектарів більше за B акрів?",
        "Чи є швидкість A км/год більшою за B м/с?",
        "Чи є тиск A Паскалів більшим за B атмосфер?",
        "Чи є енергія A Джоулів більшою за B калорій?",
        "Чи є потужність A Ватт більшою за B кінських сил?",
        "Чи є частота A Герц більшою за B обертів/хвилину?",
        "Чи є напруга A Вольт більшою за струм B Ампер (порівняння величин недоречне, але як приклад завдання)?",
        "Чи є опір A Ом більшим за ємність B Фарад?",
        "Чи є індуктивність A Генрі більшою за магнітний потік B Вебер?",
        "Чи є температура A Кельвінів вищою за B градусів Цельсія?",
        "Чи є кут A градусів більшим за B радіан?",
        "Чи є освітленість A Люкс більшою за світловий потік B Люмен?",
        "Чи є сила світла A Кандела більшою за яскравість B ніт?",
        "Чи є кількість речовини A моль більшою за масу B грам?",
        "Чи є активність радіоактивного джерела A Беккерель більшою за поглинену дозу B Грей?",
        "Чи є еквівалентна доза A Зіверт більшою за експозиційну дозу B Кулон/кг?",
        "Чи є каталітична активність A катал більшою за об'єм B літр?",
        "Чи є A біт інформації більшим за B байт?",
        "Чи є A пікселів на екрані більше за B точок на дюйм?",
        "Чи є тактова частота процесора A ГГц більшою за швидкість передачі даних B Мбіт/с?",
        "Чи є обсяг пам'яті A ГБ більшим за розмір файлу B МБ?",
        "Чи є роздільна здатність камери A мегапікселів більшою за розмір фотографії B КБ?",
        "Чи є ємність акумулятора A мА*год більшою за споживану потужність B Вт?",
        "Чи є ціна A гривень більшою за знижку B відсотків?",
        "Чи є кількість населення міста A мільйонів більшою за площу країни B тисяч кв. км?",
        "Чи є висота гори A метрів більшою за глибину океану B кілометрів?",
        "Чи є вік людини A років більшим за тривалість життя B століть?",
        "Чи є відстань до зірки A світлових років більшою за діаметр галактики B парсек?",
        "Чи є швидкість звуку A м/с більшою за швидкість світла B км/с?",
        "Чи є маса Землі A кг більшою за масу Сонця B тонн?",
        "Чи є розмір атома A пікометрів меншим за розмір молекули B нанометрів?"
    ],
    "LAB4_TASK2": [
        "Знайти два найбільші та два найменші значення серед чисел x1...x5.",
        "Перевірити, чи є серед чисел x1...x5 будь-які чотири числа, сума або добуток яких дорівнюють п’ятому числу.",
        "Визначити кількість чисел серед x1...x5, що дорівнюють значенню, максимальному серед усіх п'яти чисел.",
        "Перевірити, чи є послідовність чисел x1...x5 паліндромом, арифметичною чи геометричною прогресією.",
        "Знайти два числа серед x1...x5, найближчих одне до одного за значеннями.",
        "Підрахувати кількість непарних чисел серед x1...x5, що належать заданому діапазону [a; b) і одночасно не належать діапазону (c; d].",
        "Визначити кількість чисел серед x1...x5, що є дільниками інших чисел з цієї ж послідовності.",
        "Перевірити, чи можна розглядати задану послідовність чисел x1...x5 як запис часу та дати: x1 годин, x2 хвилин, x3 день x4 місяця x5 року?",
        "Знайти найдовший ланцюжок (неперервну підпослідовність) чисел серед x1...x5, що збільшуються.",
        "Підрахувати кількість пар однакових чисел серед x1...x5, що розташовані поряд одне з одним.",
        "Визначити довжину найбільшого ланцюжка (неперервної підпослідовності) нулів серед x1...x5.",
        "Підрахувати кількість чисел серед x1...x5, значення яких зустрічаються більш ніж один раз.",
        "Знайти середнє арифметичне та середнє геометричне усіх від’ємних чисел серед x1...x5, що діляться без остачі на 15.",
        "Визначити довжину найдовшого ланцюжка серед x1...x5, що утворює арифметичну прогресію.",
        "Знайти мінімальне значення серед усіх додатних чисел серед x1...x5.",
        "Знайти суму всіх чисел послідовності x1...x5.",
        "Знайти добуток всіх ненульових чисел послідовності x1...x5.",
        "Знайти середнє арифметичне всіх чисел послідовності x1...x5.",
        "Знайти кількість додатних чисел у послідовності x1...x5.",
        "Знайти кількість від'ємних чисел у послідовності x1...x5.",
        "Знайти кількість нулів у послідовності x1...x5.",
        "Знайти максимальний елемент у послідовності x1...x5.",
        "Знайти мінімальний елемент у послідовності x1...x5.",
        "Знайти індекс (номер) першого максимального елемента.",
        "Знайти індекс (номер) останнього мінімального елемента.",
        "Перевірити, чи всі елементи послідовності x1...x5 є парними.",
        "Перевірити, чи всі елементи послідовності x1...x5 є непарними.",
        "Перевірити, чи є хоча б один нуль у послідовності x1...x5.",
        "Перевірити, чи всі елементи послідовності x1...x5 належать діапазону [min_val, max_val].",
        "Знайти кількість елементів, більших за середнє арифметичне всіх елементів.",
        "Знайти кількість елементів, менших за середнє арифметичне всіх елементів.",
        "Знайти суму квадратів усіх елементів послідовності x1...x5.",
        "Знайти суму кубів усіх елементів послідовності x1...x5.",
        "Знайти кількість елементів, що є степенями двійки.",
        "Знайти кількість елементів, що є простими числами (для невеликих значень).",
        "Знайти кількість елементів, що є числами Фібоначчі (для невеликих значень).",
        "Знайти найдовший ланцюжок (неперервну підпослідовність) однакових чисел.",
        "Знайти найдовший ланцюжок (неперервну підпослідовність) парних чисел.",
        "Знайти найдовший ланцюжок (неперервну підпослідовність) непарних чисел.",
        "Знайти найдовший ланцюжок (неперервну підпослідовність) додатних чисел.",
        "Знайти найдовший ланцюжок (неперервну підпослідовність) від'ємних чисел.",
        "Знайти кількість елементів, що дорівнюють сумі своїх сусідів (x[i] = x[i-1] + x[i+1]).",
        "Знайти кількість елементів, що більші за обох своїх сусідів (x[i] > x[i-1] and x[i] > x[i+1]).",
        "Знайти кількість елементів, що менші за обох своїх сусідів (x[i] < x[i-1] and x[i] < x[i+1]).",
        "Перевірити, чи утворюють елементи послідовності монотонно зростаючу послідовність.",
        "Перевірити, чи утворюють елементи послідовності монотонно спадаючу послідовність.",
        "Перевірити, чи утворюють елементи послідовності незростаючу послідовність.",
        "Перевірити, чи утворюють елементи послідовності неспадну послідовність.",
        "Знайти елемент, що зустрічається найчастіше.",
        "Знайти елемент, що зустрічається найрідше.",
        "Знайти суму елементів з парними індексами.",
        "Знайти суму елементів з непарними індексами.",
        "Знайти добуток елементів з парними індексами.",
        "Знайти добуток елементів з непарними індексами.",
        "Знайти середнє арифметичне елементів з парними індексами.",
        "Знайти середнє арифметичне елементів з непарними індексами.",
        "Знайти максимальний елемент серед елементів з парними індексами.",
        "Знайти мінімальний елемент серед елементів з непарними індексами.",
        "Знайти кількість унікальних значень у послідовності.",
        "Перевірити, чи присутнє задане число K у послідовності.",
        "Знайти перший індекс входження заданого числа K у послідовність.",
        "Знайти останній індекс входження заданого числа K у послідовність.",
        "Знайти кількість входжень заданого числа K у послідовність.",
        "Знайти суму елементів, що діляться на 3.",
        "Знайти кількість елементів, що діляться на 5.",
        "Знайти добуток елементів, що не діляться на 7.",
        "Знайти середнє арифметичне елементів, що діляться на 2 і 3 одночасно.",
        "Знайти максимальне значення серед елементів, що не діляться на 4.",
        "Знайти мінімальне значення серед елементів, що діляться на 11.",
        "Знайти кількість елементів, які є квадратами цілих чисел.",
        "Знайти кількість елементів, які є кубами цілих чисел.",
        "Знайти суму елементів, які є досконалими числами (дорівнюють сумі своїх дільників, крім себе).",
        "Знайти кількість елементів, які є числами Армстронга (сума кубів цифр дорівнює самому числу).",
        "Знайти найдовший ланцюжок чисел, що утворюють геометричну прогресію.",
        "Знайти кількість елементів, модуль яких належить діапазону [low, high].",
        "Знайти суму модулів всіх елементів.",
        "Знайти добуток модулів всіх ненульових елементів.",
        "Знайти середнє геометричне додатних елементів.",
        "Знайти кількість пар сусідніх елементів, що мають різні знаки.",
        "Знайти кількість пар сусідніх елементів, де наступний елемент більший за попередній.",
        "Знайти кількість пар сусідніх елементів, де наступний елемент менший за попередній.",
        "Знайти кількість пар сусідніх елементів, що рівні між собою.",
        "Знайти елемент, найближчий до середнього арифметичного всіх елементів.",
        "Знайти елемент, найвіддаленіший від середнього арифметичного всіх елементів.",
        "Знайти суму різниць між сусідніми елементами (x2-x1 + x3-x2 + ...).",
        "Знайти максимальну різницю між будь-якими двома елементами.",
        "Знайти мінімальну різницю між будь-якими двома елементами (не нульову).",
        "Перевірити, чи є сума всіх елементів парним числом.",
        "Перевірити, чи є добуток всіх елементів додатним числом.",
        "Знайти кількість елементів, що дорівнюють сумі цифр самого елемента.",
        "Знайти кількість елементів, що дорівнюють добутку цифр самого елемента.",
        "Перевірити, чи можна вибрати три елементи, які утворюють сторони прямокутного трикутника.",
        "Перевірити, чи можна вибрати три елементи, які утворюють сторони рівностороннього трикутника.",
        "Перевірити, чи можна вибрати три елементи, які утворюють сторони рівнобедреного трикутника.",
        "Знайти кількість елементів, які можна представити як A^B (де A, B - цілі > 1).",
        "Знайти суму всіх простих чисел у послідовності.",
        "Знайти добуток всіх чисел Фібоначчі у послідовності.",
        "Знайти кількість елементів, у десятковому записі яких є цифра 0.",
        "Знайти кількість елементів, у десятковому записі яких немає цифри 5.",
        "Знайти суму елементів, які закінчуються на цифру 7."
    ],
    "LAB4_TASK3": [
        "Визначити, на скільки розрядів треба циклічно зсунути числа A і B, щоб отримати для кожного з них максимальні значення.",
        "Визначити, чи ділиться кожне з чисел A і B на 2, 3, 4, без використання операції ділення націло.",
        "Знайти кількість цифр числа A, що перебільшують відповідні цифри числа B, та кількість цифр числа B, що перебільшують відповідні цифри числа A.",
        "Визначити, в якому з чисел A чи B є найдовша неперервна послідовність нульових розрядів.",
        "Визначити, чи є число B числом A, циклічно зсунутим на кілька цифр.",
        "Визначити, чи ділиться кожне з чисел A і B на 5, 6, 7, без використання операції ділення націло.",
        "Визначити, в якій мінімально можливій системі числення записані числа A і B, та перевести їх із цієї системи в десяткову систему числення.",
        "Вважаючи пари відповідних розрядів <a1, b1> – <a5, b5> дворозрядними числами, знайти серед них найбільше та найменше значення, а також середнє арифметичне цих чисел.",
        "Визначити, чи є послідовність цифр a1, ..., a5, b1, ..., b5 правильним записом часу і дати у форматі xx : xx xx.xx.xx (години : хвилини день.місяць.рік).",
        "Знайти цифри, які зустрічаються в обох числах A і B, які зустрічаються лише в одному числі та які відсутні в обох числах.",
        "Визначити, чи ділиться кожне з чисел A і B на 8, 9, 10, 11, без використання операції ділення націло.",
        "Визначити, чи є послідовність цифр a1, ..., a5, b1, ..., b5 телефонним номером одного з мобільних операторів України, і чи є цей номер «елітним» (міру «елітності» обрати самостійно).",
        "Якщо числа A і B можуть розглядатись як числа у системі числення за заданою основою d, обчислити їх значення у десятковій системі числення.",
        "Знайти найбільше значення серед кожної пари цифр a і b, що мають однакові індекси, а також результуюче число, що утворюється із таких найбільших значень.",
        "Визначити, чи ділиться кожне з чисел A і B на 12, 13, 25 без використання операції ділення націло.",
        "Визначити, чи може розглядатись кожне з чисел A і B (залежно від свого значення) як: вік людини у роках; зріст людини в сантиметрах; вага людини в грамах; розмір взуття; поштовий індекс міста Вінниці; атмосферний тиск (у мм/рт. ст.); номер елемента в таблиці Менделєєва.",
        "Знайти суму цифр числа A та числа B.",
        "Знайти добуток цифр числа A та числа B.",
        "Знайти кількість парних цифр у числі A та числі B.",
        "Знайти кількість непарних цифр у числі A та числі B.",
        "Знайти кількість нулів у числі A та числі B.",
        "Знайти найбільшу цифру в числі A та числі B.",
        "Знайти найменшу цифру в числі A та числі B.",
        "Перевірити, чи є число A паліндромом.",
        "Перевірити, чи є число B паліндромом.",
        "Перевірити, чи складаються числа A і B з однакових цифр (незалежно від порядку і кількості).",
        "Сформувати нове число C, цифри якого є сумами відповідних цифр чисел A і B (c_i = a_i + b_i mod 10).",
        "Сформувати нове число D, цифри якого є різницями відповідних цифр чисел A і B (d_i = |a_i - b_i|).",
        "Сформувати нове число E, цифри якого є максимумами відповідних цифр чисел A і B (e_i = max(a_i, b_i)).",
        "Сформувати нове число F, цифри якого є мінімумами відповідних цифр чисел A і B (f_i = min(a_i, b_i)).",
        "Перевірити, чи є послідовність цифр числа A монотонно зростаючою.",
        "Перевірити, чи є послідовність цифр числа B монотонно спадаючою.",
        "Знайти кількість інверсій у послідовності цифр числа A (пар (i, j) таких, що i < j, але a_i > a_j).",
        "Знайти кількість інверсій у послідовності цифр числа B.",
        "Знайти найдовшу зростаючу підпослідовність цифр у числі A.",
        "Знайти найдовшу спадаючу підпослідовність цифр у числі B.",
        "Знайти цифру, що найчастіше зустрічається в числі A.",
        "Знайти цифру, що найрідше зустрічається в числі B.",
        "Перевірити, чи всі цифри в числі A є унікальними.",
        "Перевірити, чи всі цифри в числі B є унікальними.",
        "Визначити, чи можна переставити цифри числа A так, щоб отримати число B.",
        "Визначити, чи є число A щасливим (сума перших 2 цифр дорівнює сумі 2 середніх + сумі 2 останніх і т.д. залежно від кількості цифр).",
        "Визначити, чи є число B щасливим (аналогічно).",
        "Обчислити контрольну суму числа A за алгоритмом Луна (як для кредитних карток).",
        "Обчислити контрольну суму числа B за алгоритмом Луна.",
        "Перевірити, чи ділиться число A на суму своїх цифр.",
        "Перевірити, чи ділиться число B на добуток своїх цифр (якщо він не 0).",
        "Сформувати число, записане цифрами числа A у зворотному порядку.",
        "Сформувати число, записане цифрами числа B у зворотному порядку.",
        "Знайти кількість цифр у числі A, які є простими числами (2, 3, 5, 7).",
        "Знайти кількість цифр у числі B, які є складеними числами (4, 6, 8, 9).",
        "Визначити, чи є число A числом Армстронга (сума кубів цифр дорівнює числу).",
        "Визначити, чи є число B числом Армстронга.",
        "Знайти середнє арифметичне цифр числа A.",
        "Знайти середнє геометричне цифр числа B (якщо немає нулів).",
        "Знайти медіану серед цифр числа A.",
        "Знайти медіану серед цифр числа B.",
        "Визначити, чи утворюють цифри числа A арифметичну прогресію.",
        "Визначити, чи утворюють цифри числа B геометричну прогресію.",
        "Знайти кількість пар сусідніх цифр у числі A, які однакові.",
        "Знайти кількість пар сусідніх цифр у числі B, які відрізняються на 1.",
        "Знайти максимальну різницю між двома сусідніми цифрами в числі A.",
        "Знайти мінімальну різницю між двома сусідніми цифрами в числі B.",
        "Перетворити число A в двійкову систему числення (представити як рядок).",
        "Перетворити число B у вісімкову систему числення (представити як рядок).",
        "Перетворити число A в шістнадцяткову систему числення (представити як рядок).",
        "Представити число B як суму степенів двійки.",
        "Представити число A як суму степенів десяти, помножених на відповідні цифри.",
        "Визначити, чи є число A автоморфним (його квадрат закінчується цифрами самого числа).",
        "Визначити, чи є число B автоморфним.",
        "Знайти найбільший спільний дільник (НСД) для чисел A і B (розглядаючи їх як цілі числа).",
        "Знайти найменше спільне кратне (НСК) для чисел A і B.",
        "Визначити, чи є числа A і B взаємно простими.",
        "Перевірити, чи є число A досконалим (дорівнює сумі своїх дільників, крім себе).",
        "Перевірити, чи є число B досконалим.",
        "Перевірити, чи є число A надлишковим (більше суми своїх дільників).",
        "Перевірити, чи є число B недостатнім (менше суми своїх дільників).",
        "Знайти кількість дільників числа A.",
        "Знайти суму дільників числа B.",
        "Розкласти число A на прості множники.",
        "Розкласти число B на прості множники.",
        "Знайти першу цифру числа A і останню цифру числа B.",
        "Знайти суму першої і останньої цифри числа A.",
        "Знайти добуток першої і останньої цифри числа B.",
        "Перевірити, чи є перша цифра числа A більшою за останню цифру числа B.",
        "Сформувати число, замінивши в A кожну цифру d на 9-d.",
        "Сформувати число, замінивши в B кожну парну цифру на 0, а непарну на 1.",
        "Підрахувати, скільки разів цифра '1' зустрічається в числах A і B разом.",
        "Підрахувати, скільки разів цифра '7' зустрічається в числах A і B разом.",
        "Визначити, чи є сума цифр числа A простою.",
        "Визначити, чи є добуток цифр числа B квадратом цілого числа.",
        "Перевірити, чи можна сформувати просте число, використовуючи перші три цифри A.",
        "Перевірити, чи можна сформувати число Фібоначчі, використовуючи останні три цифри B.",
        "Сформувати число, що складається з парних цифр A, взятих у тому ж порядку.",
        "Сформувати число, що складається з непарних цифр B, взятих у зворотному порядку.",
        "Визначити, чи переважають у числі A парні чи непарні цифри.",
        "Визначити, чи переважають у числі B нулі чи ненульові цифри.",
        "Знайти НСД суми цифр A і суми цифр B.",
        "Знайти НСК добутку цифр A і добутку цифр B (якщо добутки не 0)."
    ],
    "LAB5_TASK1": [
        "У діапазоні [A; B] знайти суму і добуток цілих чисел, які діляться на 3.",
        "У діапазоні [A; B) знайти кількість чисел, що є квадратами цілих чисел.",
        "У діапазоні (A; B] знайти кількість чисел Фібоначчі.",
        "Знайти максимум і мінімум функції y = –4x^2 + 5 для аргументу x, що змінюється в діапазоні [A; B] з кроком 0.01.",
        "У діапазоні (A; B) знайти і вивести на екран цілі числа, які під час ділення на 7 дають остачу 1, 2 або 5.",
        "У діапазоні (A; B] знайти середнє арифметичне усіх непарних цілих чисел.",
        "У діапазоні [A; B] знайти кількість чисел, що є дільниками цілого числа K (K задається окремо).",
        "У діапазоні (A; B] знайти кількість цілих чисел, квадрати яких також знаходяться в цьому діапазоні.",
        "Визначити, що більше: добуток цілих чисел у діапазоні [A; 0) чи сума цілих чисел у діапазоні (0; B]. Вважати, що A<0, B>0.",
        "У діапазоні [A; B] знайти кількість цілих чисел, для яких у цьому ж діапазоні існує число з протилежним знаком.",
        "У діапазоні (A; B) знайти кількість цілих чисел, що діляться націло на 2 і на 3 одночасно.",
        "У діапазоні [A; B) знайти кількість цілих чисел, які можуть вважатися високосними роками (діляться на 4, крім тих, що діляться на 100, але не на 400).",
        "Знайти максимум і мінімум функції y = 3x^3 – 2x + 1 для аргументу x, що змінюється в діапазоні [A; B] з кроком 0.0005.",
        "У діапазоні [A; B] визначити, що більше: кількість цілих чисел, що діляться на 4, чи кількість цілих чисел, що є квадратами цілих чисел.",
        "Визначити, що менше: сума квадратів цілих чисел у діапазоні [A; 0) чи добуток цілих чисел у діапазоні (0; B]. Вважати, що A<0, B>0.",
        "У діапазоні (A; B) знайти середнє арифметичне цілих чисел, що діляться на 4.",
        "У діапазоні (A; B) знайти суму і добуток кожного сьомого цілого числа.",
        "Знайти середнє арифметичне значень функції y = –123.45*x – x^3 для аргументу x, що змінюється в діапазоні (A; B] з кроком 0.2.",
        "У діапазоні [A; B] знайти кількість цілих чисел, які є квадратами цілих чисел, що також знаходяться в цьому ж діапазоні [A; B].",
        "У діапазоні [A; B] знайти суму всіх парних цілих чисел.",
        "У діапазоні (A; B) знайти добуток всіх непарних цілих чисел (якщо він не надто великий).",
        "У діапазоні [A; B] знайти кількість цілих чисел, що закінчуються на цифру 5.",
        "У діапазоні (A; B] знайти кількість простих чисел.",
        "Знайти суму значень функції y = sin(x) + cos(x) для аргументу x, що змінюється в діапазоні [A; B] з кроком 0.05.",
        "У діапазоні [A; B] знайти перше і останнє ціле число, що ділиться на 11.",
        "У діапазоні (A; B) знайти кількість цілих чисел, сума цифр яких дорівнює заданому K.",
        "У діапазоні [A; B] знайти кількість чисел, що є кубами цілих чисел.",
        "Знайти середнє геометричне цілих додатних чисел у діапазоні (A; B].",
        "У діапазоні [A; B] знайти ціле число з найбільшою кількістю дільників.",
        "У діапазоні (A; B) знайти ціле число з найменшою кількістю дільників (більше 1).",
        "У діапазоні [A; B] знайти кількість чисел-паліндромів.",
        "Знайти точку x в діапазоні [A; B], де функція y = x * sin(x) досягає свого максимуму (з певним кроком).",
        "Знайти точку x в діапазоні [A; B], де функція y = exp(-x^2) * cos(5x) досягає свого мінімуму (з певним кроком).",
        "У діапазоні (A; B] знайти суму квадратів простих чисел.",
        "У діапазоні [A; B) знайти кількість досконалих чисел (дорівнюють сумі своїх дільників, крім себе).",
        "Визначити, чи більше сума чисел, що діляться на 5, чи сума чисел, що діляться на 7 у діапазоні [A; B].",
        "У діапазоні (A; B) знайти кількість чисел, що мають рівно 3 дільники (квадрати простих чисел).",
        "У діапазоні [A; B] знайти суму чисел, у десятковому записі яких є цифра 0.",
        "Знайти середнє арифметичне значень функції y = log(x) / x для аргументу x, що змінюється в діапазоні [A; B] (де A > 0) з кроком 0.1.",
        "У діапазоні (A; B] знайти кількість чисел, що є щасливими квитками (шестизначні, сума перших 3 цифр = сумі останніх 3).",
        "У діапазоні [A; B] знайти перше число, що ділиться одночасно на 3, 5 і 7.",
        "Знайти добуток значень функції y = 1 + 1/x для цілих x у діапазоні [A; B] (де x != 0).",
        "У діапазоні (A; B) знайти кількість чисел, що не містять цифри 9.",
        "У діапазоні [A; B] знайти суму обернених величин цілих чисел (1/x).",
        "Знайти кількість перетинів функції y = sin(x) з віссю Ox у діапазоні [A; B].",
        "Знайти кількість перетинів функції y = cos(x) з віссю Ox у діапазоні [A; B].",
        "У діапазоні (A; B] знайти середнє квадратичне відхилення цілих чисел.",
        "У діапазоні [A; B] знайти кількість чисел, які можна представити як суму двох квадратів.",
        "Знайти площу під графіком функції y = x^2 на відрізку [A; B] (наближено, сумуючи площі прямокутників з малим кроком).",
        "Знайти площу під графіком функції y = 1/x на відрізку [A; B] (A > 0) (наближено).",
        "У діапазоні (A; B) знайти кількість чисел, що читаються однаково зліва направо та справа наліво (паліндроми).",
        "У діапазоні [A; B] знайти суму чисел, що мають тільки непарні цифри.",
        "У діапазоні [A; B] знайти кількість чисел, що мають тільки парні цифри.",
        "Знайти середнє арифметичне кубів цілих чисел у діапазоні (A; B].",
        "У діапазоні [A; B] знайти кількість чисел, запис яких у двійковій системі є паліндромом.",
        "Знайти довжину відрізка [A; B].",
        "Знайти середину відрізка [A; B].",
        "У діапазоні (A; B) знайти найбільше ціле число, що ділиться на K.",
        "У діапазоні [A; B] знайти найменше ціле число, що ділиться на K.",
        "Знайти кількість цілих чисел у діапазоні (A, B).",
        "Знайти кількість цілих чисел у діапазоні [A, B].",
        "Знайти кількість цілих чисел у діапазоні [A, B).",
        "Знайти кількість цілих чисел у діапазоні (A, B].",
        "У діапазоні [A; B] знайти суму чисел, що кратні 2 або 3.",
        "У діапазоні (A; B] знайти суму чисел, що кратні 2, але не кратні 3.",
        "У діапазоні [A; B) знайти суму чисел, що не кратні ні 2, ні 3.",
        "Знайти суму факторіалів цілих чисел в діапазоні [A; B] (для малих B).",
        "У діапазоні [A; B] знайти кількість чисел, що є степенями п'ятірки.",
        "Знайти максимум функції y = sin(x)/x в діапазоні [A; B] (A > 0) з кроком 0.01.",
        "Знайти мінімум функції y = x * exp(-x) в діапазоні [A; B] з кроком 0.01.",
        "У діапазоні (A; B) знайти кількість чисел, сума квадратів цифр яких є простою.",
        "У діапазоні [A; B] знайти число, найближче до заданого Z.",
        "Знайти кількість цілих точок (x, y) таких, що x знаходиться в [A, B], а y = floor(sqrt(x)).",
        "У діапазоні [A; B] знайти середнє гармонійне цілих додатних чисел.",
        "Знайти кількість точок x в діапазоні [A; B] (з кроком h), де знак функції f(x) змінюється.",
        "У діапазоні (A; B] знайти кількість чисел n, таких що n! закінчується рівно на K нулів.",
        "У діапазоні [A; B] знайти суму цифр усіх цілих чисел.",
        "Знайти суму значень функції y = tan(x) для x в [A; B] з кроком 0.1 (уникаючи точок розриву).",
        "У діапазоні [A; B] знайти кількість чисел, які дорівнюють сумі факторіалів своїх цифр.",
        "Знайти число в [A; B], яке має найбільшу кількість різних простих дільників.",
        "У діапазоні (A; B) знайти кількість чисел n, таких що НСД(n, K) = 1 (де K задано).",
        "Знайти середнє арифметичне чисел Фібоначчі в діапазоні [A; B].",
        "У діапазоні [A; B] знайти кількість чисел n, таких що n ділить K (де K задано).",
        "Знайти суму коренів квадратних цілих чисел в діапазоні [A; B].",
        "У діапазоні (A; B] знайти кількість чисел, які не є дільниками K.",
        "Знайти добуток чисел, що діляться на P і не діляться на Q, у діапазоні [A; B].",
        "У діапазоні [A; B] знайти кількість чисел, які є сумами послідовних натуральних чисел.",
        "Знайти суму всіх цифр усіх цілих чисел в діапазоні [A; B].",
        "У діапазоні (A; B) знайти перше число, яке є одночасно квадратом і кубом цілого числа (степінь 6).",
        "Знайти кількість цілих чисел в [A; B], десятковий запис яких містить підрядок '123'.",
        "У діапазоні [A; B] знайти середнє значення функції y = abs(sin(x) + cos(x)) з кроком 0.05.",
        "Знайти суму обернених квадратів 1/x^2 для цілих x в [A; B] (A>0).",
        "У діапазоні (A; B] знайти кількість чисел, які дорівнюють сумі кубів своїх цифр.",
        "Знайти число в [A; B], яке має найменшу суму цифр.",
        "У діапазоні [A; B] знайти кількість чисел, у яких всі цифри різні.",
        "Знайти середнє арифметичне простих чисел в діапазоні [A; B].",
        "У діапазоні (A; B) знайти кількість чисел n, таких що phi(n) = K (де phi - функція Ейлера, K задано).",
        "Знайти суму квадратів чисел Фібоначчі в діапазоні [A; B].",
        "У діапазоні [A; B] знайти кількість чисел, які дорівнюють добутку своїх цифр.",
        "Знайти число в [A; B] з максимальною сумою дільників (включаючи саме число).",
        "У діапазоні (A; B] знайти кількість чисел, які є простими числами-близнюками (p і p+2 - прості).",
        "Знайти суму чисел в [A; B], які можна записати лише за допомогою цифр 1, 4, 9.",
        "У діапазоні [A; B] знайти середнє геометричне простих чисел.",
        "Знайти кількість точок x в [A; B] (з кроком h), де f(x) > g(x) для заданих функцій f, g.",
        "У діапазоні (A; B) знайти кількість чисел, які є паліндромами у двійковій та десятковій системах.",
        "Знайти суму значень функції y = floor(x) + ceil(x) для x в [A; B] з кроком 0.5.",
        "У діапазоні [A; B] знайти кількість чисел, що є напівпростими (добуток двох простих чисел).",
        "Знайти число в [A; B], яке має найбільший простий дільник.",
        "У діапазоні (A; B] знайти кількість трійок Піфагора (a, b, c), де c <= B.",
        "Знайти середнє арифметичне чисел в [A; B], що не містять цифри 0.",
        "У діапазоні [A; B] знайти кількість чисел, що є сумою двох простих чисел (гіпотеза Гольдбаха).",
        "Знайти суму чисел в [A; B], що є числами Каталана (для малих значень).",
        "У діапазоні (A; B) знайти перше число, що є одночасно трикутним і квадратним.",
        "Знайти кількість чисел в [A; B], що є числами Мерсенна (2^p - 1, де p - просте).",
        "У діапазоні [A; B] знайти середнє значення функції y = frac(x) (дробова частина) з кроком 0.1.",
        "Знайти суму логарифмів цілих чисел в [A; B] (A>0).",
        "У діапазоні (A; B] знайти кількість чисел, що є потужними (діляться на квадрат кожного свого простого дільника).",
        "Знайти число в [A; B], яке має найдовшу послідовність одиниць у двійковому записі.",
        "У діапазоні [A; B] знайти кількість чисел, які є числами Люка.",
        "Знайти середнє арифметичне квадратів простих чисел в діапазоні [A; B].",
        "У діапазоні (A; B) знайти кількість чисел n, для яких n^2 + 1 є простим.",
        "Знайти суму чисел в [A; B], що є факторіонами.",
        "У діапазоні [A; B] знайти кількість чисел, що є числами Вампіра.",
        "Знайти середнє значення функції y = x mod K для x в [A; B] з кроком 1.",
        "Знайти добуток цифр всіх цілих чисел в діапазоні [A; B] (якщо немає нулів).",
        "У діапазоні (A; B] знайти кількість чисел, що є числами Сміта.",
        "Знайти число в [A; B], яке має найбільшу кількість нулів у двійковому записі."
    ],
    "LAB5_TASK2": [
        "Знайти в діапазоні [0; A] числа, які відповідають таким вимогам: є дільником числа A; є непарним; сума цифр не перебільшує K (K=30).",
        "У діапазоні [0; A] знайти кількість чисел, для яких їх зворотний запис ділиться на задане число B.",
        "У діапазоні [0; A] знайти кількість чисел, які можна вважати записаними у вісімковій системі числення (містять цифри 0-7). Також знайти суму таких чисел у десятковій системі числення.",
        "У діапазоні [0; A] знайти середнє арифметичне чисел, у яких усі цифри різні.",
        "У діапазоні [0; A] знайти кількість чисел, із цифр яких можна скласти дільник числа A (шляхом перестановки цифр).",
        "У діапазоні [0; A] знайти три найбільші числа, із цифр яких можна скласти квадрат цілого числа (шляхом перестановки цифр).",
        "У діапазоні [0; A] знайти перше і останнє числа, в яких є дві однакові цифри, не менші 5.",
        "Серед усіх чисел діапазону [0; A] знайти кількість чисел, із цифр яких можна скласти число, яке ділиться на задане число B і не є дільником числа A.",
        "У діапазоні [0; A] знайти кількість, суму і середнє арифметичне чисел, із цифр яких можна скласти числа, що є дільниками числа A^2.",
        "У діапазоні [0; A] знайти кількість чисел, із цифр яких можна скласти числа, які є дільниками суми усіх цілих чисел цього діапазону [0; A].",
        "Серед усіх чисел діапазону [0; A] знайти кількість чисел, сума цифр яких дорівнює K (K=25). Також знайти суму і добуток таких чисел.",
        "Серед усіх чисел діапазону [0; A] знайти кількість чисел, із цифр яких можна скласти число, яке ділиться одночасно на 2, 5 та 7.",
        "Серед усіх чисел діапазону [0; A] знайти кількість чисел, сума цифр яких є квадратом цілого числа. Також знайти середнє арифметичне таких чисел.",
        "Серед усіх чисел діапазону [0; A] знайти кількість чисел, із цифр яких можна скласти непарне число, що є дільником числа A^2.",
        "Серед усіх чисел діапазону [0; A] знайти кількість чисел, сума цифр яких дорівнює сумі цифр числа A.",
        "Серед усіх чисел діапазону [0; A] знайти кількість чисел, із цифр яких можна скласти число, що є кубом цілого числа. Також знайти найбільше таке число в цьому діапазоні.",
        "Для діапазону чисел [0; A] визначити, що більше: кількість чисел, у яких цифри розташовані в порядку збільшення (наприклад, 157), чи кількість чисел, у яких цифри розташовані в порядку зменшення (наприклад, 943).",
        "Серед усіх чисел діапазону [0; A] знайти кількість чисел, у яких відсутні цифри, що є в числі A (у його десятковому записі). Знайти також найбільше таке число в цьому діапазоні.",
        "У діапазоні [0; A] знайти суму всіх чисел, що є паліндромами.",
        "У діапазоні [0; A] знайти кількість чисел, що діляться на суму своїх цифр.",
        "У діапазоні [0; A] знайти кількість чисел, що діляться на добуток своїх цифр (якщо він не 0).",
        "Знайти середнє арифметичне чисел у діапазоні [0; A], що є простими.",
        "Знайти кількість чисел у діапазоні [0; A], що є числами Фібоначчі.",
        "У діапазоні [0; A] знайти число з максимальною кількістю дільників.",
        "У діапазоні [0; A] знайти число з мінімальною кількістю дільників (більше 1).",
        "Знайти суму квадратів чисел у діапазоні [0; A], що є непарними.",
        "Знайти добуток чисел у діапазоні [0; A], що закінчуються на цифру 1 (якщо він не надто великий).",
        "У діапазоні [0; A] знайти кількість чисел, що містять принаймні одну цифру 7.",
        "У діапазоні [0; A] знайти кількість чисел, що не містять цифри 0.",
        "Знайти середнє геометричне чисел у діапазоні [0; A], що є квадратами цілих чисел.",
        "У діапазоні [0; A] знайти перше і останнє просте число.",
        "Знайти кількість чисел у діапазоні [0; A], у яких перша і остання цифри однакові.",
        "Знайти суму чисел у діапазоні [0; A], у яких сума першої та останньої цифри дорівнює K.",
        "У діапазоні [0; A] знайти кількість чисел, у яких всі цифри парні.",
        "У діапазоні [0; A] знайти кількість чисел, у яких всі цифри непарні.",
        "Знайти середнє арифметичне чисел у діапазоні [0; A], що є кубами цілих чисел.",
        "У діапазоні [0; A] знайти число, найближче до A/2.",
        "Знайти кількість чисел у діапазоні [0; A], які можна представити як суму двох простих чисел.",
        "Знайти суму чисел у діапазоні [0; A], двійковий запис яких містить рівно три одиниці.",
        "Знайти кількість чисел у діапазоні [0; A], шістнадцятковий запис яких містить тільки цифри (0-9).",
        "У діапазоні [0; A] знайти число, яке має найбільшу суму цифр.",
        "У діапазоні [0; A] знайти число, яке має найменшу суму цифр.",
        "Знайти кількість чисел у діапазоні [0; A], що є автоморфними (квадрат закінчується на саме число).",
        "Знайти суму чисел у діапазоні [0; A], що є надлишковими (більші за суму своїх дільників).",
        "Знайти кількість чисел у діапазоні [0; A], що є недостатніми (менші за суму своїх дільників).",
        "У діапазоні [0; A] знайти число з найбільшою кількістю нулів у десятковому записі.",
        "У діапазоні [0; A] знайти число з найбільшою кількістю однакових цифр підряд.",
        "Знайти середнє арифметичне чисел у діапазоні [0; A], що не мають у записі цифри 5.",
        "Знайти кількість чисел у діапазоні [0; A], запис яких є строго зростаючою послідовністю цифр.",
        "Знайти кількість чисел у діапазоні [0; A], запис яких є строго спадаючою послідовністю цифр.",
        "У діапазоні [0; A] знайти число, яке дорівнює сумі факторіалів своїх цифр.",
        "Знайти суму чисел у діапазоні [0; A], які є дільниками числа A.",
        "Знайти кількість пар (x, y) в діапазоні [0; A], таких що x + y = A.",
        "Знайти кількість пар (x, y) в діапазоні [0; A], таких що x * y = A.",
        "У діапазоні [0; A] знайти число, найбільш віддалене від середнього арифметичного цього діапазону.",
        "Знайти кількість чисел у діапазоні [0; A], які діляться на K, але не діляться на M.",
        "Знайти суму квадратних коренів з чисел у діапазоні [0; A], що є повними квадратами.",
        "У діапазоні [0; A] знайти число, що має найбільший простий дільник.",
        "Знайти кількість чисел у діапазоні [0; A], у яких друга цифра більша за першу.",
        "Знайти суму чисел у діапазоні [0; A], у яких кількість парних цифр дорівнює кількості непарних.",
        "У діапазоні [0; A] знайти число, яке має максимальну різницю між найбільшою та найменшою цифрою.",
        "Знайти середнє гармонійне чисел у діапазоні [0; A], що є простими.",
        "У діапазоні [0; A] знайти кількість чисел, які дорівнюють сумі кубів своїх цифр.",
        "Знайти число в діапазоні [0; A], яке є паліндромом і простим одночасно (якщо таке існує).",
        "Знайти суму чисел у діапазоні [0; A], які можна записати як x^x для цілого x > 0.",
        "У діапазоні [0; A] знайти кількість чисел n, таких що n! ділиться на B.",
        "Знайти число в діапазоні [0; A], у якого сума першої половини цифр дорівнює сумі другої половини цифр.",
        "У діапазоні [0; A] знайти кількість чисел, які є сумами двох квадратів.",
        "Знайти середнє арифметичне чисел у діапазоні [0; A], що починаються і закінчуються на однакову цифру.",
        "У діапазоні [0; A] знайти число, яке має найбільшу кількість входжень цифри K.",
        "Знайти суму чисел у діапазоні [0; A], що є щасливими числами (ітеративна сума квадратів цифр зводиться до 1).",
        "У діапазоні [0; A] знайти кількість чисел, які є степенями K.",
        "Знайти число в діапазоні [0; A], яке має найменший добуток цифр (ненульовий).",
        "Знайти кількість чисел у діапазоні [0; A], які є трикутними числами (n*(n+1)/2).",
        "Знайти суму чисел у діапазоні [0; A], які є числами Каталана (для малих A).",
        "У діапазоні [0; A] знайти число, двійковий запис якого містить найбільшу кількість одиниць.",
        "Знайти середнє арифметичне чисел у діапазоні [0; A], що є числами Мерсенна.",
        "У діапазоні [0; A] знайти кількість чисел, запис яких не містить сусідніх однакових цифр.",
        "Знайти число в діапазоні [0; A], яке має найбільшу кількість різних дільників.",
        "Знайти суму чисел у діапазоні [0; A], які є числами Сміта.",
        "У діапазоні [0; A] знайти кількість чисел, що є добутками двох послідовних простих чисел.",
        "Знайти число в діапазоні [0; A], яке найближче до K^2 (де K - ціле).",
        "Знайти кількість чисел у діапазоні [0; A], які дорівнюють N * (сума цифр N).",
        "Знайти суму чисел у діапазоні [0; A], які є числами Люка.",
        "У діапазоні [0; A] знайти число, яке має найбільшу відстань до найближчого простого числа.",
        "Знайти середнє арифметичне чисел у діапазоні [0; A], які є сумами трьох кубів.",
        "У діапазоні [0; A] знайти кількість чисел, що є числами-вампірами.",
        "Знайти число в діапазоні [0; A], яке має найменшу суму квадратів цифр.",
        "Знайти кількість чисел у діапазоні [0; A], які є добутками трьох різних простих чисел.",
        "Знайти суму чисел у діапазоні [0; A], що є досконалими степенями (a^b, де a, b > 1).",
        "У діапазоні [0; A] знайти число, яке має найбільшу кількість простих дільників (з урахуванням кратності).",
        "Знайти середнє арифметичне чисел у діапазоні [0; A], які є паліндромами у вісімковій системі.",
        "У діапазоні [0; A] знайти кількість чисел, які є числами Перріна.",
        "Знайти число в діапазоні [0; A], у якого відношення числа до суми його цифр є максимальним.",
        "Знайти кількість чисел у діапазоні [0; A], які є числами Хофштадтера Q(1)=Q(2)=1, Q(n)=Q(n-Q(n-1))+Q(n-Q(n-2)).",
        "Знайти суму чисел у діапазоні [0; A], що є суперпростими (прості числа, що займають прості позиції у послідовності простих чисел).",
        "У діапазоні [0; A] знайти число, яке має найбільшу кількість нулів на кінці запису n!.",
        "Знайти середнє арифметичне чисел у діапазоні [0; A], які є сильними числами (сума факторіалів цифр дорівнює числу).",
        "У діапазоні [0; A] знайти кількість чисел, які є практичними числами.",
        "Знайти число в діапазоні [0; A], що має найбільше значення функції Ейлера phi(n).",
        "Знайти кількість чисел у діапазоні [0; A], що є числами Улама.",
        "Знайти суму чисел у діапазоні [0; A], що є числами Маркова.",
        "У діапазоні [0; A] знайти число, яке має найменшу кількість одиниць у двійковому записі (більше 0).",
        "Знайти середнє арифметичне чисел у діапазоні [0; A], що є числами Зиселя.",
        "У діапазоні [0; A] знайти кількість чисел, що є числами Кармайкла.",
        "Знайти число в діапазоні [0; A], яке дорівнює сумі четвертих степенів своїх цифр."
    ],
    "LAB6": [
        [
            "Замість кількох пробілів, що розташовані підряд, залишити лише один пробіл.",
            "Знайти кількість слів, що починаються на голосну літеру."
        ],
        [
            "Видалити усі пробіли на початку рядка.",
            "Знайти найдовше слово в рядку."
        ],
        [
            "Видалити усі пробіли в кінці рядка.",
            "Знайти кількість слів, що закінчуються на голосну літеру."
        ],
        [
            "Усі маленькі приголосні літери зробити великими.",
            "Знайти кількість слів, у яких перша й остання літери голосні або приголосні (обидві голосні або обидві приголосні)."
        ],
        [
            "Кожну цифру замінити відповідним словом, після якого додати пробіл (наприклад, «агент 007» буде перетворений на «агент нуль нуль сім »).",
            "Знайти кількість слів, у яких усі голосні є літерою «о»."
        ],
        [
            "Між кожними двома літерами додати символ підкреслення.",
            "Знайти кількість слів, що мають першу велику літеру, а інші маленькі."
        ],
        [
            "Видалити усі голосні літери.",
            "Знайти кількість слів, що складаються рівно з K літер (K = 5)."
        ],
        [
            "Видалити усі символи, окрім літер і пробілів.",
            "Знайти кількість слів, у яких є парні приголосні літери («нн», «вв», «тт» тощо)."
        ],
        [
            "Знайти голосну літеру, яка найбільш часто зустрічається у рядку.",
            "Визначити, чи є в рядку слова-паліндроми (без урахування великих та малих літер)."
        ],
        [
            "Усі голосні літери замінити на символи підкреслення.",
            "Визначити, чи дорівнює кількість відкриваючих дужок кількості закриваючих дужок (враховувати круглі, квадратні та фігурні)."
        ],
        [
            "Замінити усі некруглі дужки на круглі (квадратні та фігурні на круглі).",
            "Знайти слова, що складаються тільки із заголовних літер."
        ],
        [
            "Знайти голосні літери, які не містяться у рядку.",
            "У кожному слові поміняти місцями першу і останню літери."
        ],
        [
            "Замінити усі великі літери на маленькі.",
            "Знайти слово, у якому найбільша кількість приголосних літер."
        ],
        [
            "Замінити усі приголосні літери цифрами «1», голосні – цифрами «0», великі літери – символами «*».",
            "Знайти слова, у яких голосних літер більше, ніж приголосних."
        ],
        [
            "Визначити, чи є в рядку числа (послідовності цифр).",
            "У кожній трійці символів розташувати символи у зворотному порядку."
        ],
        [
            "Знайти середню довжину слів у рядку (кількість символів / кількість слів).",
            "Якщо після розділового знака (коми, крапки, знаку оклику тощо) немає пробілу – додати його."
        ],
        [
            "Замість кожної цифри записати цифру, на одиницю більшу. Замість цифри 9 записати нуль.",
            "Відносно загальної кількості символів у рядку знайти відсоток голосних літер, приголосних літер, цифр та інших символів."
        ],
        [
            "Знайти кількість слів з апострофами.",
            "Замість подвійних літер (напр., 'нн', 'аа') залишити одну."
        ],
        [
            "Замінити кожну цифру її кодом з азбуки Морзе (наприклад, 1 -> '.----').",
            "Знайти найменшу цифру в рядку."
        ],
        [
            "З’ясувати, чи наявні в рядку лише латинські літери, чи лише кириличні літери.",
            "Розташувати слова у зворотному порядку (спочатку останнє слово, потім передостаннє та ін.)."
        ],
        [
            "Підрахувати загальну кількість символів у рядку.",
            "Підрахувати кількість речень у рядку (за крапками, знаками оклику, питання)."
        ],
        [
            "Видалити всі розділові знаки.",
            "Знайти слово з найменшою кількістю голосних літер."
        ],
        [
            "Кожне слово написати з великої літери.",
            "Підрахувати кількість слів, що містять цифри."
        ],
        [
            "Перетворити рядок на 'ЗаБоРчИк' (чергування великих та малих літер).",
            "Знайти кількість слів, що починаються і закінчуються на одну й ту ж літеру."
        ],
        [
            "Подвоїти кожну голосну літеру.",
            "Знайти найкоротше слово в рядку."
        ],
        [
            "Видалити кожне третє слово.",
            "Перевірити, чи є рядок паліндромом (без урахування пробілів, розділових знаків і регістру)."
        ],
        [
            "Замінити всі входження слова 'Python' на 'Java'.",
            "Знайти кількість слів, що містять рівно три голосні."
        ],
        [
            "Видалити всі символи, що не є літерами кирилиці.",
            "Знайти слово, в якому максимальна кількість повторень однієї літери."
        ],
        [
            "Вставити символ '*' після кожної приголосної літери.",
            "Підрахувати кількість слів, у яких більше приголосних, ніж голосних."
        ],
        [
            "Видалити всі слова, що коротші за 4 символи.",
            "Знайти перше і останнє слово в рядку."
        ],
        [
            "Перевести всі літери у верхній регістр.",
            "Знайти кількість пар сусідніх слів, що починаються на однакову літеру."
        ],
        [
            "Видалити з рядка всі цифри.",
            "Знайти слово, що зустрічається найчастіше."
        ],
        [
            "Замінити кожну крапку на знак оклику.",
            "Підрахувати кількість слів, що мають парну кількість літер."
        ],
        [
            "Інвертувати регістр кожної літери (великі -> маленькі, маленькі -> великі).",
            "Знайти кількість слів, що не містять голосних літер."
        ],
        [
            "Видалити дублікати пробілів.",
            "Знайти приголосну літеру, яка найбільш часто зустрічається у рядку."
        ],
        [
            "Обрізати рядок до перших 50 символів.",
            "Визначити, чи містить рядок задане підслово 'приклад'."
        ],
        [
            "Замінити всі коми на крапки з комою.",
            "Знайти кількість слів, що починаються на приголосну, а закінчуються на голосну."
        ],
        [
            "Розділити рядок на слова та вивести кожне слово з нового рядка.",
            "Знайти кількість унікальних слів у рядку."
        ],
        [
            "Додати крапку в кінці рядка, якщо її там немає.",
            "Знайти середню кількість голосних літер у слові."
        ],
        [
            "Видалити всі слова, що містять літеру 'ь'.",
            "Визначити, чи всі слова в рядку починаються з великої літери."
        ],
        [
            "Замінити кожне слово на його довжину (число).",
            "Знайти найдовше слово, що є паліндромом."
        ],
        [
            "Вставити пробіл перед кожною великою літерою (крім першої).",
            "Підрахувати кількість слів, у яких літери впорядковані за алфавітом."
        ],
        [
            "Видалити перше і останнє слово рядка.",
            "Знайти слово з максимальною кількістю унікальних літер."
        ],
        [
            "Зашифрувати рядок шифром Цезаря з зсувом 3.",
            "Визначити, чи є в рядку слова, що римуються (закінчуються однаково)."
        ],
        [
            "Видалити всі символи латиниці.",
            "Знайти кількість слів, що містять подвоєні голосні ('аа', 'оо' тощо)."
        ],
        [
            "Кожне речення написати у зворотному порядку слів.",
            "Знайти відсоток слів, що складаються з однієї літери."
        ],
        [
            "Замінити всі знаки питання на знаки оклику.",
            "Знайти найкоротше слово, що починається на літеру 'П'."
        ],
        [
            "Видалити з рядка всі голосні літери, що стоять на парних позиціях.",
            "Знайти кількість слів, які містять хоча б одну цифру."
        ],
        [
            "Сформувати новий рядок, що складається тільки з перших літер кожного слова.",
            "Визначити, яке слово частіше зустрічається: 'і' чи 'та'."
        ],
        [
            "Замінити кожне входження 'ого' на 'ово'.",
            "Знайти слово, що має найбільшу суму кодів символів."
        ],
        [
            "Видалити всі слова, що містять менше 3 унікальних літер.",
            "Підрахувати кількість слів, де перша літера зустрічається ще раз."
        ],
        [
            "Розташувати символи кожного слова за алфавітом.",
            "Знайти найдовше слово, що не містить літери 'а'."
        ],
        [
            "Додати ' :) ' після кожного речення.",
            "Знайти кількість слів, у яких кількість голосних дорівнює кількості приголосних."
        ],
        [
            "Видалити символи, що повторюються підряд (aaa -> a, bbb -> b).",
            "Знайти слово з найменшою кількістю приголосних."
        ],
        [
            "Замінити кожне слово на 'WORD'.",
            "Визначити, чи є кількість слів у рядку парною."
        ],
        [
            "Видалити всі літери 'е', 'є', 'и', 'і'.",
            "Знайти кількість слів, які закінчуються на '-ння'."
        ],
        [
            "Сформувати рядок з останніх літер кожного слова.",
            "Знайти найкоротше слово, що містить літеру 'ф'."
        ],
        [
            "Замінити всі тире на дефіси.",
            "Підрахувати кількість слів, що містять більше двох голосних підряд."
        ],
        [
            "Видалити кожну другу літеру в рядку.",
            "Знайти найдовше слово, що складається тільки з голосних або тільки з приголосних."
        ],
        [
            "Вставити випадкову цифру після кожного слова.",
            "Визначити, чи симетричний рядок відносно центру (перший символ = останній, другий = передостанній і т.д.)."
        ]
    ],
    "LAB7_TASK1": [
        "Написати функцію для знаходження точки перетину двох прямих на площині, заданих коефіцієнтами ax+by+c=0.",
        "Написати функцію, яка знаходить місце на прямолінійній дорозі для колодязя, щоб сума відстаней від трьох будинків (заданих координатами) до колодязя була найменшою.",
        "Написати функцію для знаходження кута (в градусах) між годинною та хвилинною стрілками для заданого часу (години, хвилини).",
        "Написати функцію для знаходження кута (в градусах) між двома прямими, що перетинаються, заданими кутовими коефіцієнтами.",
        "Написати функцію, яка перевіряє, чи є чотири точки A, B, C, D (задані координатами) вершинами квадрата.",
        "Написати функцію, яка для заданої суми грошей знаходить мінімальну кількість банкнот (1, 2, 5, 10, 20, 50, 100, 200, 500, 1000 грн), якою можна набрати цю суму.",
        "Написати функцію, яка для заданого числа N знаходить таке тризначне число X, що X + reverse(X) = N (де reverse(X) - число X, записане у зворотному порядку).",
        "Написати функцію, яка для заданої параболи y = ax^2 + bx + c знаходить відстань між точками її перетину з віссю абсцис (Ox).",
        "Написати функцію, яка для відрізка AB (заданого точками A і B) знаходить точку M, що ділить відрізок у відношенні AM / MB = K / L (K, L задаються).",
        "Написати функцію, яка знаходить на осі абсцис (Ox) точку, рівновіддалену від початку координат (0,0) та заданої точки A(x,y).",
        "Написати функцію, яка перевіряє, чи лежать три задані точки на одній прямій.",
        "Написати функцію, яка знаходить відстань від точки M(x,y) до прямої, заданої рівнянням ax+by+c=0.",
        "Написати функцію, яка обчислює час (в годинах), за який два майстри виконають роботу разом, якщо перший виконує її за T1 годин, а другий – за T2 годин.",
        "Написати функцію, яка розраховує загальну суму виплат за іпотечним кредитом (вартість квартири X, термін K років, річна ставка M відсотків).",
        "Написати функцію, яка розраховує необхідну суму депозиту для отримання щомісячного чистого прибутку S гривень при ставці X відсотків річних (враховуючи 19.5% податків з доходу).",
        "Написати функцію, яка знаходить найбільше п’ятизначне число, кратне K, у якого перша цифра дорівнює D і усі цифри різні.",
        "Написати функцію, яка для позиції білого короля та чорного ферзя на шаховій дошці (8x8) визначає ситуацію: шах, мат, пат чи відсутність загрози.",
        "Написати функцію, яка знаходить відстань від вершини прямого кута трикутника (з катетами a, b) до центра прямокутника, побудованого на гіпотенузі, де один бік прямокутника дорівнює гіпотенузі, а другий – у 2 рази довший.",
        "Написати функцію для знаходження кількості днів між двома датами (заданими як день, місяць, рік).",
        "Написати функцію, яка розраховує, скільки грамів 96% спирту треба долити в посудину (де був 70% спирт, але випарувалося X г спирту та Y г води), щоб відновити попередню концентрацію.",
        "Написати функцію, яка знаходить час наповнення басейну кожною з двох труб окремо, якщо разом вони наповнюють за X годин, а перша труба виливає на Y% води більше за годину, ніж друга.",
        "Написати функцію, яка для арифметичної прогресії знаходить суму перших N членів, якщо відомо, що i-й член дорівнює A, а j-й член дорівнює B.",
        "Написати функцію, яка знаходить кількість коренів рівняння ||x-6|–4|=a залежно від параметра a.",
        "Написати функцію, яка визначає номер людини, що залишиться останньою, якщо K людей стоять по колу і кожен другий вибуває (задача Йосифа Флавія).",
        "Написати функцію для знаходження кількості хвилин між двома моментами часу (заданими як година:хвилина). Якщо другий момент менший за перший, вважати, що він наступної доби.",
        "Написати функцію, яка за координатами трьох точок визначає тип трикутника: рівнобічний, рівнобедрений, різносторонній, відрізок чи точка.",
        "Написати функцію, яка для поточного часу (години, хвилини) знаходить найближчий час, коли годинна та хвилинна стрілки співпадуть, та час до цього моменту.",
        "Написати функцію, яка розраховує час (в годинах) до зустрічі двох автомобілів, що виїхали назустріч один одному з двох міст (відстань d, швидкості V1, V2).",
        "Написати функцію, яка перетворює ціле число від 0 до 1000 у його словесний запис українською мовою (наприклад, 752 -> «сімсот п’ятдесят два»).",
        "Написати функцію, яка перетворює словесний запис цілого числа від 0 до 1000 (наприклад, «сімсот п’ятдесят два») у відповідне ціле число.",
        "Написати функцію, яка визначає, чий день народження (з двох заданих дат) ближчий до поточної дати (враховуючи перехід через Новий рік).",
        "Написати функцію, яка для двох квадратів на площині (заданих координатами лівого верхнього кута та стороною) визначає їх взаємне розташування: не перетинаються, перетинаються, торкаються чи співпадають.",
        "Написати функцію для обчислення факторіалу числа N.",
        "Написати функцію для обчислення N-го числа Фібоначчі.",
        "Написати функцію для перевірки, чи є число простим.",
        "Написати функцію для знаходження найбільшого спільного дільника (НСД) двох чисел.",
        "Написати функцію для знаходження найменшого спільного кратного (НСК) двох чисел.",
        "Написати функцію для переведення числа з десяткової системи в двійкову.",
        "Написати функцію для переведення числа з двійкової системи в десяткову.",
        "Написати функцію для обчислення суми цифр числа.",
        "Написати функцію для обчислення добутку цифр числа.",
        "Написати функцію для перевірки, чи є число паліндромом.",
        "Написати функцію для розв'язання квадратного рівняння ax^2 + bx + c = 0.",
        "Написати функцію для обчислення площі трикутника за формулою Герона (за трьома сторонами).",
        "Написати функцію для обчислення периметра трикутника за координатами вершин.",
        "Написати функцію для обчислення площі трикутника за координатами вершин.",
        "Написати функцію для перевірки, чи можна з трьох відрізків заданої довжини скласти трикутник.",
        "Написати функцію для обчислення відстані між двома точками на площині.",
        "Написати функцію для обчислення відстані між двома точками в тривимірному просторі.",
        "Написати функцію для знаходження середнього арифметичного чисел у списку.",
        "Написати функцію для знаходження середнього геометричного чисел у списку.",
        "Написати функцію для знаходження медіани чисел у списку.",
        "Написати функцію для знаходження максимального елемента в списку.",
        "Написати функцію для знаходження мінімального елемента в списку.",
        "Написати функцію для сортування списку чисел методом бульбашки.",
        "Написати функцію для сортування списку чисел методом вибору.",
        "Написати функцію для сортування списку чисел методом вставки.",
        "Написати функцію для пошуку елемента в списку методом лінійного пошуку.",
        "Написати функцію для пошуку елемента у відсортованому списку методом бінарного пошуку.",
        "Написати функцію для обчислення суми матриць.",
        "Написати функцію для обчислення добутку матриць.",
        "Написати функцію для транспонування матриці.",
        "Написати функцію для обчислення визначника матриці 2x2.",
        "Написати функцію для обчислення визначника матриці 3x3.",
        "Написати функцію для перевірки, чи є рядок паліндромом (ігноруючи регістр та пробіли).",
        "Написати функцію для підрахунку кількості входжень символу в рядок.",
        "Написати функцію для підрахунку кількості слів у рядку.",
        "Написати функцію для заміни всіх входжень підрядка в рядку на інший підрядок.",
        "Написати функцію для перевертання рядка.",
        "Написати функцію для обчислення довжини гіпотенузи прямокутного трикутника за двома катетами.",
        "Написати функцію для обчислення площі кола за радіусом.",
        "Написати функцію для обчислення довжини кола за радіусом.",
        "Написати функцію для обчислення площі прямокутника за сторонами.",
        "Написати функцію для обчислення периметра прямокутника за сторонами.",
        "Написати функцію для обчислення об'єму куба за стороною.",
        "Написати функцію для обчислення площі поверхні куба за стороною.",
        "Написати функцію для обчислення об'єму циліндра за радіусом основи та висотою.",
        "Написати функцію для обчислення площі бічної поверхні циліндра.",
        "Написати функцію для обчислення об'єму конуса.",
        "Написати функцію для обчислення площі бічної поверхні конуса.",
        "Написати функцію для обчислення об'єму сфери за радіусом.",
        "Написати функцію для обчислення площі поверхні сфери за радіусом.",
        "Написати функцію для переведення градусів Цельсія в Фаренгейти.",
        "Написати функцію для переведення градусів Фаренгейта в Цельсія.",
        "Написати функцію для переведення кілометрів у милі.",
        "Написати функцію для переведення миль у кілометри.",
        "Написати функцію для обчислення індексу маси тіла (ІМТ).",
        "Написати функцію для розрахунку складних відсотків.",
        "Написати функцію для генерації випадкового цілого числа в заданому діапазоні.",
        "Написати функцію для генерації випадкового дійсного числа в заданому діапазоні.",
        "Написати функцію для тасування елементів списку.",
        "Написати функцію для вибору випадкового елемента зі списку.",
        "Написати функцію для знаходження кореня функції методом ділення навпіл.",
        "Написати функцію для знаходження кореня функції методом Ньютона.",
        "Написати функцію для обчислення інтеграла функції методом прямокутників.",
        "Написати функцію для обчислення інтеграла функції методом трапецій.",
        "Написати функцію для обчислення інтеграла функції методом Сімпсона.",
        "Написати функцію для обчислення похідної функції в точці (чисельно).",
        "Написати функцію для апроксимації даних методом найменших квадратів (лінійна регресія).",
        "Написати функцію для обчислення відстані Левенштейна між двома рядками.",
        "Написати функцію для шифрування тексту шифром Цезаря.",
        "Написати функцію для дешифрування тексту, зашифрованого шифром Цезаря.",
        "Написати функцію для шифрування тексту шифром Віженера.",
        "Написати функцію для дешифрування тексту, зашифрованого шифром Віженера.",
        "Написати функцію для перевірки коректності розстановки дужок у виразі.",
        "Написати функцію для перетворення інфіксного запису виразу в постфіксний (зворотний польський запис).",
        "Написати функцію для обчислення значення виразу, записаного в постфіксній нотації.",
        "Написати функцію для реалізації стеку.",
        "Написати функцію для реалізації черги.",
        "Написати функцію для реалізації зв'язного списку.",
        "Написати функцію для реалізації двійкового дерева пошуку.",
        "Написати функцію для обходу двійкового дерева (прямий, зворотний, симетричний).",
        "Написати функцію для пошуку шляху в графі (пошук в ширину або глибину)."
    ],
    "LAB9_TASK1": [
        "Знайти суму всіх невід’ємних елементів масиву, менших за середнє арифметичне усіх елементів масиву.",
        "Знайти максимальний і мінімальний елементи серед елементів масиву, кратних 3.",
        "Знайти відстань (кількість елементів) між першим максимальним та останнім мінімальним елементами масиву.",
        "Знайти перші три найбільші (максимальні) елементи масиву.",
        "Знайти середнє арифметичне усіх недодатних елементів масиву, кратних 7.",
        "Знайти кількість елементів масиву, для яких у цьому ж масиві існують елементи з протилежним знаком.",
        "Серед елементів масиву, що лежать у діапазоні [0; 100], знайти кількість оцінок «A» (90-100), «B» (80-89), «C» (70-79), «D» (60-69), «E» (50-59), «FX» (0-49).",
        "Знайти кількість чисел-паліндромів у масиві, що мають не менш ніж три розряди.",
        "Перевірити, чи є елементи масиву впорядкованими за зменшенням або за збільшенням.",
        "Знайти кількість елементів масиву, перед якими та після яких розташовані числа з протилежним знаком.",
        "Знайти кількість елементів масиву, які є дільниками початкового елементу масиву (якщо масив не порожній).",
        "Знайти суму, добуток та кількість елементів масиву, які одночасно діляться на 3 і на 5.",
        "Знайти середнє арифметичне елементів масиву, розташованих між індексами A і B (значення A і B задаються).",
        "Знайти добуток елементів масиву без урахування нульових елементів та максимального і мінімального елементів масиву.",
        "Знайти відсоток додатних, від’ємних та нульових елементів масиву.",
        "Знайти кількість ненульових елементів масиву, сусідами яких є нульові елементи.",
        "Знайти середнє арифметичне елементів масиву, індекси яких є числами Фібоначчі.",
        "Знайти кількість елементів масиву, що мають у своєму десятковому записі рівно два нулі.",
        "Знайти кількість елементів масиву, що є квадратами цілих чисел.",
        "Знайти кількість елементів масиву, для яких у цьому масиві присутні їх квадрати.",
        "Знайти кількість додатних елементів масиву, сусідами яких є від’ємні елементи.",
        "Знайти суму і кількість елементів масиву, розташованих між першим мінімальним та останнім максимальним елементами масиву.",
        "Знайти індекси максимального і мінімального за модулем елементів масиву.",
        "Знайти кількість елементів масиву, що є дільниками максимального елементу масиву.",
        "Знайти елемент масиву, найбільш близький до середнього арифметичного елементів масиву.",
        "Знайти кількість елементів масиву, які за модулем більші за середнє арифметичне елементів масиву.",
        "Знайти відстань (кількість елементів) між першим і останнім нульовими елементами масиву.",
        "Знайти середнє арифметичне першого додатного та останнього від’ємного елементів масиву, що не діляться націло на 4.",
        "Знайти кількість елементів масиву, що є кубами цілих чисел.",
        "Знайти елемент, який зустрічається в масиві найбільшу кількість разів.",
        "Знайти суму всіх елементів масиву.",
        "Знайти середнє арифметичне всіх елементів масиву.",
        "Знайти максимальний елемент масиву та його індекс.",
        "Знайти мінімальний елемент масиву та його індекс.",
        "Знайти кількість додатних елементів масиву.",
        "Знайти кількість від'ємних елементів масиву.",
        "Знайти кількість нульових елементів масиву.",
        "Знайти суму елементів з парними індексами.",
        "Знайти суму елементів з непарними індексами.",
        "Знайти кількість елементів, більших за задане число K.",
        "Знайти кількість елементів, менших за задане число K.",
        "Знайти кількість елементів, що належать заданому діапазону [min_val, max_val].",
        "Знайти перший додатний елемент масиву.",
        "Знайти останній від'ємний елемент масиву.",
        "Знайти суму квадратів елементів масиву.",
        "Знайти суму кубів елементів масиву.",
        "Перевірити, чи містить масив задане число K.",
        "Знайти індекс першого входження заданого числа K.",
        "Знайти індекс останнього входження заданого числа K.",
        "Знайти кількість входжень заданого числа K.",
        "Знайти кількість унікальних елементів у масиві.",
        "Знайти елементи, які зустрічаються в масиві більше одного разу.",
        "Знайти елементи, які зустрічаються в масиві рівно один раз.",
        "Знайти кількість елементів, що є степенями двійки.",
        "Знайти кількість елементів, що є простими числами.",
        "Знайти кількість елементів, що є числами Фібоначчі.",
        "Знайти найдовшу послідовність однакових елементів, що йдуть підряд.",
        "Знайти найдовшу зростаючу послідовність елементів, що йдуть підряд.",
        "Знайти найдовшу спадаючу послідовність елементів, що йдуть підряд.",
        "Знайти кількість локальних максимумів (елемент більший за сусідів).",
        "Знайти кількість локальних мінімумів (елемент менший за сусідів).",
        "Знайти суму елементів, розташованих до першого нульового елемента.",
        "Знайти суму елементів, розташованих після останнього нульового елемента.",
        "Знайти середнє арифметичне елементів, розташованих між першим і останнім додатними елементами.",
        "Знайти добуток елементів, розташованих між першим і останнім від'ємними елементами.",
        "Знайти кількість пар сусідніх елементів, що мають однакові знаки.",
        "Знайти кількість пар сусідніх елементів, що мають різні знаки.",
        "Знайти кількість пар сусідніх елементів, де наступний елемент є квадратом попереднього.",
        "Знайти кількість пар сусідніх елементів, де їх сума дорівнює заданому K.",
        "Знайти елемент, найбільш віддалений від середнього арифметичного масиву.",
        "Знайти медіану масиву (після сортування).",
        "Знайти середнє геометричне додатних елементів масиву.",
        "Знайти середнє гармонійне ненульових елементів масиву.",
        "Знайти кількість елементів, що є досконалими числами.",
        "Знайти кількість елементів, що є числами Армстронга.",
        "Перевірити, чи утворюють елементи масиву арифметичну прогресію.",
        "Перевірити, чи утворюють елементи масиву геометричну прогресію.",
        "Знайти суму елементів, у десятковому записі яких є цифра 5.",
        "Знайти кількість елементів, у десятковому записі яких немає цифри 0.",
        "Знайти елемент з найбільшою сумою цифр.",
        "Знайти елемент з найменшою сумою цифр.",
        "Знайти кількість елементів, що є щасливими квитками (шестизначні).",
        "Знайти суму елементів, що знаходяться на позиціях, кратних 3.",
        "Знайти добуток елементів, що знаходяться на позиціях, кратних 5.",
        "Знайти кількість елементів, модуль яких є простим числом.",
        "Знайти елементи, які дорівнюють сумі своїх сусідів.",
        "Знайти суму елементів, які більші за попередній елемент.",
        "Знайти кількість елементів, які менші за наступний елемент.",
        "Знайти різницю між максимальним і мінімальним елементами масиву.",
        "Знайти суму різниць між сусідніми елементами (|a[i] - a[i-1]|).",
        "Перевірити, чи симетричний масив відносно свого центру.",
        "Знайти кількість елементів, що дорівнюють своєму індексу.",
        "Знайти суму елементів, індекси яких є простими числами.",
        "Знайти елементи, що знаходяться між двома заданими значеннями K1 і K2.",
        "Знайти кількість елементів, які є точними степенями (a^b, a>1, b>1).",
        "Знайти суму елементів, що залишилися б після видалення всіх дублікатів.",
        "Перевірити, чи кожен елемент масиву (крім першого) більший за попередній.",
        "Перевірити, чи кожен елемент масиву (крім першого) менший за попередній.",
        "Знайти кількість елементів, що дорівнюють сумі цифр самого елемента.",
        "Знайти кількість елементів, що дорівнюють добутку цифр самого елемента.",
        "Знайти елемент, найближчий до заданого числа Z.",
        "Знайти елемент, найвіддаленіший від заданого числа Z.",
        "Знайти кількість елементів, двійковий запис яких є паліндромом.",
        "Знайти суму елементів, шістнадцятковий запис яких містить літеру 'A'.",
        "Знайти елементи, які є дільниками всіх інших елементів масиву.",
        "Знайти кількість елементів, які є кратними хоча б одному іншому елементу масиву.",
        "Знайти середнє арифметичне елементів, що стоять на парних позиціях, і середнє арифметичне елементів на непарних позиціях.",
        "Знайти суму елементів, що розташовані до елемента з максимальним модулем.",
        "Знайти добуток елементів, що розташовані після елемента з мінімальним модулем."
    ],
    "LAB9_TASK2": [
        "Впорядкувати за зменшенням елементи масиву, розташовані після останнього мінімального елемента.",
        "Впорядкувати за збільшенням елементи масиву, розташовані до першого максимального елемента.",
        "Розташувати спочатку від’ємні, потім нульові, потім додатні елементи масиву, зберігаючи відносний порядок всередині груп.",
        "Кожен п’ятий елемент масиву замінити середнім арифметичним чотирьох попередніх елементів.",
        "Кожен елемент масиву (крім першого і останнього) зробити рівним сумі двох сусідніх елементів (використовуючи вихідні значення).",
        "У кожній трійці послідовних елементів масиву розташувати ці елементи в порядку збільшення.",
        "Видалити з масиву усі елементи, рівні максимальному або мінімальному елементам масиву.",
        "Видалити з масиву усі елементи, що не є кубами цілих чисел.",
        "Впорядкувати усі елементи масиву за збільшенням їх модулів.",
        "Поміняти між собою елементи масиву з індексами (0 і 2), (1 і 3), (4 і 6), (5 і 7), і так далі.",
        "Перемістити нульові елементи у початок масиву без зміни відносного порядку розташування інших (ненульових) елементів.",
        "Збільшити кожен елемент масиву на K відсотків від суми двох попередніх елементів (значення K задається).",
        "Розташувати елементи масиву, що знаходяться перед останнім максимальним елементом, у зворотному порядку.",
        "Видалити з масиву усі елементи, що оточені з обох боків нулями.",
        "Після кожної трійки послідовних елементів масиву вставити новий елемент, що дорівнює середньому арифметичному цих трьох елементів.",
        "Переставити першу і другу половини елементів масиву місцями (якщо кількість елементів непарна, середній залишається на місці).",
        "Розташувати усі елементи масиву у зворотному порядку, але зберігши початкове розташування (індекс) максимального елементу масиву.",
        "Видалити з масиву усі елементи, розташовані між першим максимальним і останнім мінімальним елементами масиву (включно).",
        "Усі додатні елементи масиву зменшити на значення мінімального додатного елемента, усі від’ємні елементи збільшити на значення максимального від’ємного елементу.",
        "У кожній п’ятірці послідовних елементів масиву розташувати ці елементи у зворотному порядку.",
        "Видалити елементи справа і зліва від усіх елементів, що дорівнюють максимальному елементу масиву (якщо такі сусіди існують).",
        "У кожній парі послідовних елементів масиву видалити найменший елемент.",
        "Видалити з масиву усі елементи, в десятковому записі яких зустрічаються цифри 3 або 5.",
        "Замінити усі максимальні елементи масиву мінімальними, а усі мінімальні – максимальними.",
        "Після кожного п’ятого елементу масиву вставити новий елемент, що дорівнює сумі цих п’яти елементів.",
        "Видалити усі від’ємні елементи, що розташовані між першим максимальним і першим мінімальним елементами масиву.",
        "Видалити з масиву усі елементи, що є квадратами цілих чисел.",
        "Видалити усі додатні непарні елементи, після чого продублювати (вставити копію після оригіналу) усі від’ємні парні елементи.",
        "Замінити декілька повторюваних підряд нульових елементів одним нульовим елементом.",
        "Обміняти місцями перший додатний та останній від’ємний елементи масиву, після чого видалити з масиву усі інші елементи, рівні цим двом (окрім них самих).",
        "Відсортувати масив за зростанням.",
        "Відсортувати масив за спаданням.",
        "Перевернути масив (змінити порядок на зворотний).",
        "Заповнити масив нулями.",
        "Замінити всі від'ємні елементи їх модулями.",
        "Замінити всі парні елементи нулями.",
        "Замінити всі непарні елементи одиницями.",
        "Піднести кожен елемент масиву до квадрату.",
        "Обчислити квадратний корінь з кожного невід'ємного елемента.",
        "Додати до кожного елемента масиву значення першого елемента.",
        "Відняти від кожного елемента масиву значення останнього елемента.",
        "Помножити кожен елемент масиву на його індекс.",
        "Розділити кожен елемент масиву на його індекс + 1 (якщо індекс+1 не 0).",
        "Циклічно зсунути масив вліво на одну позицію.",
        "Циклічно зсунути масив вправо на одну позицію.",
        "Циклічно зсунути масив вліво на K позицій.",
        "Циклічно зсунути масив вправо на K позицій.",
        "Видалити з масиву всі дублікати, залишивши тільки перші входження.",
        "Видалити з масиву всі елементи, що менші за середнє арифметичне.",
        "Видалити з масиву всі елементи, що більші за середнє арифметичне.",
        "Вставити задане число K після кожного додатного елемента.",
        "Вставити задане число K перед кожним від'ємним елементом.",
        "Видалити кожен другий елемент масиву.",
        "Видалити кожен третій елемент масиву.",
        "Продублювати кожен елемент масиву (a, b, c -> a, a, b, b, c, c).",
        "Продублювати кожен нульовий елемент масиву.",
        "Об'єднати два масиви (додати елементи другого в кінець першого).",
        "Знайти перетин двох масивів (елементи, що є в обох).",
        "Знайти різницю двох масивів (елементи, що є в першому, але немає в другому).",
        "Знайти симетричну різницю двох масивів.",
        "Поміняти місцями елементи з парними та непарними індексами (a[0]<->a[1], a[2]<->a[3], ...).",
        "Відсортувати першу половину масиву за зростанням, другу - за спаданням.",
        "Розташувати елементи так: спочатку парні, потім непарні (зберігаючи відносний порядок).",
        "Замінити кожен елемент на суму всіх попередніх елементів (кумулятивна сума).",
        "Замінити кожен елемент на середнє арифметичне його та його сусідів (якщо вони існують).",
        "Видалити елементи, що знаходяться на простих індексах.",
        "Видалити елементи, що є простими числами.",
        "Вставити 0 між кожними двома елементами з різними знаками.",
        "Замінити всі елементи, більші за K, на K.",
        "Замінити всі елементи, менші за K, на K.",
        "Видалити елементи, які дорівнюють сумі своїх сусідів.",
        "Видалити елементи, які є локальними максимумами.",
        "Видалити елементи, які є локальними мінімумами.",
        "Обнулити всі елементи між першим і останнім нульовими елементами.",
        "Обнулити всі елементи поза діапазоном індексів [A, B].",
        "Замінити кожен елемент на кількість цифр у ньому.",
        "Замінити кожен елемент на суму його цифр.",
        "Видалити елементи, що є паліндромами.",
        "Продублювати елементи, що є квадратами цілих чисел.",
        "Відсортувати елементи між першим мінімальним і першим максимальним елементами.",
        "Перемістити всі елементи, рівні K, в кінець масиву.",
        "Перемістити всі елементи, рівні K, на початок масиву.",
        "Замінити кожен елемент на різницю між ним та наступним елементом (останній замінити на 0).",
        "Видалити елементи, які повторюються більше двох разів.",
        "Вставити середнє арифметичне масиву після кожного елемента, більшого за нього.",
        "Замінити від'ємні елементи на -1, додатні на 1, нульові залишити 0.",
        "Видалити всі елементи, що не належать діапазону [min_val, max_val].",
        "Перемішати елементи масиву у випадковому порядку.",
        "Відсортувати масив так, щоб спочатку йшли елементи, що діляться на 3, потім ті, що дають остачу 1, потім ті, що дають остачу 2.",
        "Видалити з масиву підмасив від індексу A до індексу B.",
        "Вставити інший масив у поточний, починаючи з індексу K.",
        "Замінити кожен елемент на його ранг у відсортованому масиві.",
        "Видалити елементи, які є числами Фібоначчі.",
        "Продублювати елементи, які є простими числами.",
        "Замінити кожен елемент на найближче до нього просте число.",
        "Видалити елементи, двійковий запис яких містить більше 5 одиниць.",
        "Замінити кожен елемент на кількість його дільників.",
        "Відсортувати масив за кількістю дільників елементів.",
        "Видалити елементи, у яких перша цифра дорівнює останній.",
        "Вставити 0 перед кожним елементом, що є степенем двійки.",
        "Замінити кожен елемент на відстань до найближчого нуля в масиві.",
        "Відсортувати масив за останньою цифрою елементів.",
        "Видалити елементи, які є щасливими квитками.",
        "Продублювати елементи, які є досконалими числами.",
        "Замінити кожен елемент на значення функції Ейлера phi(n) від нього.",
        "Відсортувати масив за значенням функції Ейлера.",
        "Видалити елементи, які є числами Армстронга.",
        "Вставити факторіал індексу перед кожним елементом (для малих індексів)."
    ],
    "LAB10_TASK1": [
        "Знайти суму елементів матриці, розташованих праворуч та вище від першого максимального елементу.",
        "Знайти номер стовпця, сума модулів елементів якого максимальна.",
        "Знайти розташування (рядок, стовпець) елементу, найбільш близького за значенням до середнього арифметичного елементів матриці.",
        "Знайти суму парних елементів матриці, що належать непарним стовпцям.",
        "Знайти відсоток елементів матриці, які перевищують середнє арифметичне всіх елементів.",
        "Знайти номери рядків, елементи яких утворюють арифметичну прогресію.",
        "Знайти номери стовпців, елементи яких утворюють геометричну прогресію.",
        "Знайти суму елементів прямокутного підмасиву, обмеженого координатами першого максимального та першого мінімального елементів матриці.",
        "Знайти кількість елементів матриці, кратних середньому арифметичному всіх елементів (якщо середнє - ціле).",
        "Знайти добуток елементів матриці, розташованих ліворуч і нижче від першого мінімального елементу.",
        "Знайти кількість рядків матриці, усі елементи яких непарні.",
        "Знайти кількість стовпців і рядків, що містять хоча б один нульовий елемент.",
        "Знайти номер рядка з найбільшою кількістю елементів, що дорівнюють індексу цього рядка.",
        "Знайти добуток максимального серед парних елементів і мінімального серед непарних елементів матриці.",
        "Знайти відсоток елементів матриці, що не перевищують середнє арифметичне всіх елементів.",
        "Знайти середнє арифметичне елементів матриці, що не перевищують середнє арифметичне всіх елементів.",
        "Знайти кількість непарних елементів матриці, що лежать у діапазоні [A; B] (значення A і B задаються).",
        "Знайти координати найбільшого від’ємного та найменшого невід’ємного елементів матриці.",
        "Знайти кількість рядків, усі елементи яких від’ємні, і кількість стовпців, усі елементи яких невід’ємні.",
        "Знайти відсоток додатних, від’ємних і нульових елементів у кожному рядку матриці.",
        "Знайти кількість елементів матриці, кратних заданому числу A і не кратних заданому числу B.",
        "Знайти середнє арифметичне елементів, що межують (по горизонталі, вертикалі, діагоналі) із першим максимальним елементом матриці.",
        "Знайти кількість стовпців-паліндромів (читаються однаково зверху вниз і знизу вгору).",
        "Знайти кількість рядків, усі елементи яких є степенями числа 2.",
        "Знайти суму максимальних елементів окремих рядків матриці.",
        "Перевірити, чи існує в матриці рядок, сума елементів якого дорівнює сумі елементів одного зі стовпців.",
        "Знайти середнє арифметичне двох чисел: середнього арифметичного максимального і мінімального елементів та середнього арифметичного усіх елементів матриці.",
        "Знайти суму елементів головної діагоналі.",
        "Знайти суму елементів побічної діагоналі.",
        "Знайти максимальний елемент матриці.",
        "Знайти мінімальний елемент матриці.",
        "Знайти середнє арифметичне всіх елементів матриці.",
        "Знайти суму елементів у заданому рядку K.",
        "Знайти суму елементів у заданому стовпці K.",
        "Знайти максимальний елемент у заданому рядку K.",
        "Знайти мінімальний елемент у заданому стовпці K.",
        "Знайти кількість додатних елементів у матриці.",
        "Знайти кількість від'ємних елементів у матриці.",
        "Знайти кількість нульових елементів у матриці.",
        "Знайти суму елементів, що знаходяться вище головної діагоналі.",
        "Знайти суму елементів, що знаходяться нижче головної діагоналі.",
        "Знайти добуток елементів на головній діагоналі.",
        "Знайти добуток елементів на побічній діагоналі.",
        "Знайти номер рядка з максимальною сумою елементів.",
        "Знайти номер стовпця з мінімальною сумою елементів.",
        "Знайти кількість рядків, що містять тільки додатні елементи.",
        "Знайти кількість стовпців, що містять тільки від'ємні елементи.",
        "Знайти кількість рядків, сума елементів яких більша за задане K.",
        "Знайти кількість стовпців, добуток елементів яких менший за задане K.",
        "Знайти елемент, найближчий до заданого числа Z.",
        "Знайти кількість елементів, що дорівнюють заданому числу K.",
        "Знайти координати першого входження заданого числа K.",
        "Знайти координати останнього входження заданого числа K.",
        "Знайти кількість елементів, що є парними.",
        "Знайти кількість елементів, що є непарними.",
        "Знайти суму елементів, що знаходяться в кутах матриці.",
        "Знайти середнє арифметичне елементів, що знаходяться на периметрі матриці.",
        "Знайти кількість рядків-паліндромів.",
        "Знайти кількість стовпців, де елементи впорядковані за зростанням.",
        "Знайти кількість рядків, де елементи впорядковані за спаданням.",
        "Знайти сідлову точку (елемент, мінімальний у своєму рядку і максимальний у своєму стовпці).",
        "Знайти кількість локальних максимумів (елемент більший за всіх сусідів).",
        "Знайти кількість локальних мінімумів (елемент менший за всіх сусідів).",
        "Знайти суму елементів, що знаходяться на парних рядках і непарних стовпцях.",
        "Знайти добуток елементів, що знаходяться на непарних рядках і парних стовпцях.",
        "Знайти середнє арифметичне елементів головної діагоналі.",
        "Знайти середнє геометричне додатних елементів побічної діагоналі.",
        "Знайти рядок, що містить найбільшу кількість нулів.",
        "Знайти стовпець, що містить найменшу кількість нулів.",
        "Знайти кількість елементів, що є квадратами цілих чисел.",
        "Знайти кількість елементів, що є простими числами.",
        "Знайти суму елементів, що є числами Фібоначчі.",
        "Перевірити, чи є матриця симетричною відносно головної діагоналі.",
        "Перевірити, чи є матриця симетричною відносно побічної діагоналі.",
        "Знайти кількість елементів, більших за середнє арифметичне свого рядка.",
        "Знайти кількість елементів, менших за середнє арифметичне свого стовпця.",
        "Знайти максимальний елемент серед елементів, що знаходяться вище головної діагоналі.",
        "Знайти мінімальний елемент серед елементів, що знаходяться нижче побічної діагоналі.",
        "Знайти суму мінімальних елементів кожного рядка.",
        "Знайти суму максимальних елементів кожного стовпця.",
        "Знайти рядок з найменшим середнім арифметичним значенням.",
        "Знайти стовпець з найбільшим середнім арифметичним значенням.",
        "Знайти кількість елементів, що дорівнюють сумі своїх сусідів (по горизонталі та вертикалі).",
        "Знайти елемент з найбільшою кількістю однакових сусідів.",
        "Знайти середнє арифметичне елементів, що знаходяться в заштрихованій області (наприклад, шаховий порядок).",
        "Знайти кількість рядків, де сума елементів першої половини дорівнює сумі елементів другої половини.",
        "Знайти кількість стовпців, де добуток елементів першої половини дорівнює добутку елементів другої половини.",
        "Знайти рядок, найбільш схожий на перший рядок (за сумою квадратів різниць відповідних елементів).",
        "Знайти стовпець, найбільш відмінний від останнього стовпця.",
        "Знайти суму елементів, індекси яких (рядок i, стовпець j) задовольняють умову i+j = K.",
        "Знайти добуток елементів, індекси яких задовольняють умову i-j = K.",
        "Знайти середнє арифметичне елементів, що лежать у кільці між двома квадратами з центром у центрі матриці.",
        "Знайти кількість елементів, що дорівнюють сумі індексів свого рядка і стовпця (a[i][j] == i + j).",
        "Знайти рядок, що містить найбільшу кількість паліндромів.",
        "Знайти стовпець, що містить найбільшу кількість простих чисел.",
        "Знайти суму елементів, що лежать на перетині K перших рядків і L останніх стовпців.",
        "Знайти максимальний елемент серед елементів, що зустрічаються більше одного разу.",
        "Знайти мінімальний елемент серед унікальних елементів матриці."
    ],
    "LAB10_TASK2": [
        "Замінити нулями елементи матриці, що межують (по горизонталі, вертикалі, діагоналі) із першим максимальним та першим мінімальним елементами.",
        "Виконати сортування за зменшенням елементів рядка, який містить перший мінімальний елемент матриці.",
        "Змінити знаки на протилежні для всіх елементів, які не належать рядку або стовпцю, що містять перший максимальний елемент.",
        "Поміняти місцями рядки, що містять перший мінімальний та перший максимальний елементи матриці.",
        "Виконати обнулення елементів головної та побічної діагоналей, яким належать перший максимальний та перший мінімальний елементи матриці.",
        "Кожен рядок матриці посунути циклічно на стільки елементів вправо, щоб максимальний елемент цього рядка опинився в останньому стовпці.",
        "Спочатку розташувати елементи кожного рядка матриці в порядку збільшення, після чого розташувати елементи кожного стовпця в порядку зменшення.",
        "Поміняти місцями стовпці, що містять перший максимальний і перший мінімальний елементи матриці.",
        "Розрахувати кумулятивну (накопичувальну) суму для елементів кожного рядка. Результат записати в ту ж матрицю (наприклад, [1, 2, 3] -> [1, 3, 6]).",
        "У кожному стовпці матриці розташувати спочатку усі додатні елементи, потім усі від’ємні, а потім – нульові елементи (зберігаючи відносний порядок всередині груп).",
        "Створити новий масив (матрицю), який буде відповідати транспонованій матриці для заданого масиву.",
        "Для кожного рядка: якщо з його елементів можна побудувати арифметичну прогресію, замінити рядок нулями.",
        "Для кожного стовпця: якщо з його елементів можна побудувати геометричну прогресію, замінити стовпець одиницями.",
        "Усі елементи матриці, рівні максимальному, замінити на мінімальний елемент. Усі елементи, рівні мінімальному, замінити на максимальний елемент.",
        "Обробити усі стовпці матриці: якщо сума елементів стовпця від’ємна – розташувати елементи стовпця в порядку збільшення; якщо додатна – в порядку зменшення.",
        "У кожному непарному стовпці матриці розташувати елементи у зворотному порядку (зверху вниз -> знизу вгору).",
        "Замінити нулями усі ненульові елементи матриці, навколо яких (всі 8 сусідів) знаходяться лише нульові елементи.",
        "Якщо перший мінімальний і перший максимальний елементи знаходяться в одному рядку чи стовпці, впорядкувати елементи цього рядка або стовпця в порядку збільшення.",
        "Якщо в матриці від’ємних елементів більше, ніж додатних, зробити усі ненульові елементи матриці від’ємними. В іншому випадку зробити усі ненульові елементи додатними.",
        "Кожну пару стовпців матриці (0-й з 1-м, 2-й з 3-м і т.д.) поміняти місцями.",
        "Усі елементи матриці, що є квадратами цілих чисел і не дорівнюють максимальному та мінімальному елементам, замінити їх квадратними коренями.",
        "Стовпець, що містить найбільшу кількість від’ємних елементів, впорядкувати за збільшенням.",
        "Рядок, у якому більшість елементів – нулі, поміняти місцями з першим рядком матриці.",
        "Транспонувати матрицю.",
        "Відсортувати елементи кожного рядка за зростанням.",
        "Відсортувати елементи кожного стовпця за спаданням.",
        "Замінити всі елементи головної діагоналі нулями.",
        "Замінити всі елементи побічної діагоналі одиницями.",
        "Поміняти місцями перший і останній рядок.",
        "Поміняти місцями перший і останній стовпець.",
        "Обнулити рядок K.",
        "Обнулити стовпець K.",
        "Замінити всі від'ємні елементи їх модулями.",
        "Замінити всі парні елементи в матриці на 0.",
        "Замінити всі непарні елементи в матриці на 1.",
        "Піднести кожен елемент матриці до квадрату.",
        "Додати до кожного елемента матриці значення елемента [0, 0].",
        "Відняти від кожного елемента матриці середнє арифметичне всієї матриці.",
        "Помножити кожен елемент матриці на суму індексів його рядка і стовпця (i+j).",
        "Циклічно зсунути всі рядки матриці вниз на одну позицію.",
        "Циклічно зсунути всі рядки матриці вгору на одну позицію.",
        "Циклічно зсунути всі стовпці матриці вправо на одну позицію.",
        "Циклічно зсунути всі стовпці матриці вліво на одну позицію.",
        "Замінити кожен елемент на максимальний елемент у його рядку.",
        "Замінити кожен елемент на мінімальний елемент у його стовпці.",
        "Нормалізувати кожен рядок (розділити кожен елемент на суму елементів рядка, якщо сума не 0).",
        "Нормалізувати кожен стовпець (розділити кожен елемент на суму елементів стовпця, якщо сума не 0).",
        "Відобразити матрицю симетрично відносно головної діагоналі.",
        "Відобразити матрицю симетрично відносно побічної діагоналі.",
        "Відобразити матрицю симетрично відносно вертикальної осі.",
        "Відобразити матрицю симетрично відносно горизонтальної осі.",
        "Повернути матрицю на 90 градусів за годинниковою стрілкою.",
        "Повернути матрицю на 90 градусів проти годинникової стрілки.",
        "Повернути матрицю на 180 градусів.",
        "Замінити кожен елемент на середнє арифметичне його сусідів (4 сусіди).",
        "Замінити кожен елемент на середнє арифметичне його сусідів (8 сусідів).",
        "Застосувати до матриці фільтр згладжування (наприклад, усереднення 3x3).",
        "Застосувати до матриці фільтр виділення контурів (наприклад, оператор Собеля).",
        "Заповнити матрицю за зразком 'змійка' (по рядках, чергуючи напрямок).",
        "Заповнити матрицю за зразком 'равлик' (по спіралі від країв до центру).",
        "Видалити рядок K.",
        "Видалити стовпець K.",
        "Вставити рядок з нулів на позицію K.",
        "Вставити стовпець з одиниць на позицію K.",
        "Обміняти місцями елементи головної та побічної діагоналей.",
        "Замінити всі елементи вище головної діагоналі на 0.",
        "Замінити всі елементи нижче побічної діагоналі на 1.",
        "Відсортувати елементи головної діагоналі.",
        "Відсортувати елементи побічної діагоналі.",
        "Замінити кожен елемент на кількість елементів у матриці, менших за нього.",
        "Замінити кожен елемент на відстань до найближчого нуля в матриці.",
        "Розташувати рядки матриці в порядку зростання їх сум.",
        "Розташувати стовпці матриці в порядку спадання їх сум.",
        "Перемішати рядки матриці у випадковому порядку.",
        "Перемішати стовпці матриці у випадковому порядку.",
        "Замінити кожен рядок його зворотною копією.",
        "Замінити кожен стовпець його зворотною копією."
    ],
    "LAB11": [
        "Знайти шар ґрунту (індекс першого виміру) з найбільшою сумарною цінністю корисних копалин (нафта=1, вугілля=1, руда=2, золото=10) без урахування трудовитрат.",
        "Обчислити середню кількість золота (елементів зі значенням 7) в одному шарі ґрунту.",
        "Обчислити відсоток кожної корисної копалини (нафта, вугілля, руда, золото) від загальної кількості всіх корисних копалин у всьому об'ємі.",
        "Знайти кількість прибуткових вертикальних стовпців (для яких сумарний прибуток від копалин більший за сумарні трудовитрати на видобуток до найглибшої копалини в стовпці).",
        "Знайти координати (рядок, стовпець) найбільш прибуткового вертикального стовпця (де різниця між сумарним прибутком і трудовитратами максимальна).",
        "Знайти кількість вертикальних стовпців, що не містять води (значення 3), але містять хоча б один елемент золота (значення 7).",
        "Знайти координати (рядок, стовпець) вертикального стовпця з найбільшими сумарними трудовитратами (без урахування прибутку).",
        "Обчислити відсоток вертикальних стовпців, що не містять жодних прибуткових корисних копалин (нафта, вугілля, руда, золото).",
        "Обчислити відсоток золота, що знаходиться у перших трьох поверхневих шарах (індекси 0, 1, 2), порівняно з загальною кількістю золота у всьому об'ємі.",
        "Обчислити середню прибутковість одного вертикального стовпця (середнє значення різниці між прибутком і витратами по всіх стовпцях).",
        "Знайти індекси шарів ґрунту, у яких кількість води (значення 3) перевищує 50 % від загальної кількості елементів у цьому шарі.",
        "Знайти координати (рядок, стовпець) вертикального стовпця з найбільшою кількістю золота у верхній половині шарів ґрунту (від індексу 0 до l/2).",
        "Обчислити відсоток вертикальних стовпців, що не містять жодних гірських порід (значення 0, 1, 2).",
        "Знайти індекси шарів ґрунту з максимальною і мінімальною кількістю гірських порід (значення 0, 1, 2).",
        "Знайти найбільшу глибину (індекс першого виміру + 1) залягання поверхневих джерел води (перший елемент зі значенням 3 у вертикальному стовпці).",
        "Знайти індекс шару ґрунту, в якому кількість золота менша, ніж в інших шарах, що містять золото, але не нульова.",
        "Знайти кількість вертикальних стовпців, у яких сумарний прибуток від золота більший за сумарний прибуток від інших корисних копалин (нафта, вугілля, руда) без урахування трудовитрат.",
        "Знайти координати (рядок, стовпець) вертикального стовпця з найдовшою неперервною послідовністю 'золотих' елементів (значення 7), починаючи з верхнього шару ґрунту (індекс 0).",
        "Обчислити відсоток вертикальних стовпців, у яких золото (значення 7) знаходиться більш ніж у половині шарів ґрунту (кількість золота > l/2).",
        "Знайти кількість вертикальних стовпців, у яких найнижчі шари (хоча б один, починаючи з індексу l-1 і вище) безперервно зайняті водою (значення 3).",
        "Знайти загальну кількість елементів кожного типу ґрунту (0-7).",
        "Знайти шар з найбільшою кількістю м'якої породи (0).",
        "Знайти шар з найменшою кількістю надтвердої породи (2).",
        "Знайти вертикальний стовпець з найбільшою кількістю води (3).",
        "Знайти вертикальний стовпець з найменшою кількістю води (3).",
        "Знайти шар з найбільшою сумарною складністю видобутку (сума трудовитрат всіх елементів шару).",
        "Знайти шар з найменшою сумарною складністю видобутку.",
        "Знайти вертикальний стовпець з найменшими трудовитратами.",
        "Знайти середню глибину залягання нафти (4).",
        "Знайти середню глибину залягання кам'яного вугілля (5).",
        "Знайти середню глибину залягання залізної руди (6).",
        "Знайти середню глибину залягання золота (7).",
        "Знайти шар, де співвідношення золото/руда є максимальним.",
        "Знайти вертикальний стовпець, де співвідношення нафта/вода є максимальним.",
        "Знайти кількість вертикальних стовпців, що складаються тільки з гірських порід (0, 1, 2).",
        "Знайти кількість вертикальних стовпців, що складаються тільки з води (3).",
        "Знайти кількість вертикальних стовпців, що не містять надтвердих порід (2).",
        "Знайти шар з максимальною кількістю різних типів корисних копалин.",
        "Знайти вертикальний стовпець з максимальною кількістю різних типів ґрунту.",
        "Знайти середній прибуток від одного елемента нафти (з урахуванням трудовитрат до нього).",
        "Знайти середній прибуток від одного елемента золота (з урахуванням трудовитрат до нього).",
        "Знайти шар з найбільшим відсотком золота.",
        "Знайти шар з найменшим відсотком води.",
        "Знайти кількість вертикальних стовпців, де золото знаходиться глибше за нафту.",
        "Знайти кількість вертикальних стовпців, де руда знаходиться вище за вугілля.",
        "Знайти найприбутковіший шар (сумарний прибуток мінус сумарні витрати).",
        "Знайти найзбитковіший шар.",
        "Знайти координати (шар, рядок, стовпець) першого знайденого елемента золота.",
        "Знайти координати останнього знайденого елемента нафти.",
        "Знайти середню кількість елементів корисної копалини на один вертикальний стовпець.",
        "Знайти середню кількість елементів гірської породи на один шар.",
        "Знайти шар, в якому сума трудовитрат на видобуток всіх копалин мінімальна.",
        "Знайти вертикальний стовпець, в якому всі типи корисних копалин присутні.",
        "Знайти відсоток об'єму, зайнятого водою.",
        "Знайти відсоток об'єму, зайнятого гірськими породами.",
        "Знайти відсоток об'єму, зайнятого прибутковими копалинами.",
        "Знайти шар з найбільшим перепадом типів ґрунту (максимальна різниця значень сусідніх елементів у шарі).",
        "Знайти вертикальний стовпець з найменшим перепадом типів ґрунту (мінімальна різниця значень сусідніх елементів у стовпці).",
        "Знайти кількість 'островів' золота в заданому шарі (зв'язані області елементів 7).",
        "Знайти кількість 'озер' води на поверхні (зв'язані області елементів 3 у шарі 0).",
        "Знайти найглибший шар, що містить м'яку породу (0).",
        "Знайти найвищий шар, що містить надтверду породу (2).",
        "Знайти вертикальний стовпець, де послідовність типів ґрунту є монотонно зростаючою (за значенням).",
        "Знайти вертикальний стовпець, де послідовність типів ґрунту є монотонно спадаючою.",
        "Знайти шар, де кількість нафти дорівнює кількості вугілля.",
        "Знайти вертикальний стовпець, де кількість руди дорівнює кількості золота.",
        "Знайти середню складність видобутку одного 'одиниця прибутку' (загальні витрати / загальний прибуток).",
        "Знайти шар, який найбільш схожий на попередній шар (мінімальна сума квадратів різниць).",
        "Знайти вертикальний стовпець, який найбільш схожий на сусідній стовпець.",
        "Знайти кількість вертикальних стовпців, де тип ґрунту змінюється не більше K разів.",
        "Знайти шар, де середнє значення типу ґрунту максимальне.",
        "Знайти шар, де середнє значення типу ґрунту мінімальне.",
        "Знайти вертикальний стовпець, де середнє значення типу ґрунту найближче до 3.5.",
        "Знайти відсоток вертикальних стовпців, що починаються з води (елемент [0][r][c] == 3).",
        "Знайти відсоток вертикальних стовпців, що закінчуються золотом (елемент [l-1][r][c] == 7).",
        "Знайти шар з найбільшою кількістю елементів, що відрізняються від своїх сусідів по шару.",
        "Знайти вертикальний стовпець з найбільшою кількістю елементів, що відрізняються від своїх сусідів по стовпцю.",
        "Знайти найтовстіший пласт золота (максимальна кількість послідовних елементів 7 у вертикальному стовпці).",
        "Знайти найтовстіший пласт води.",
        "Знайти кількість вертикальних стовпців, де немає різких переходів складності (різниця трудовитрат сусідніх елементів < 3).",
        "Знайти шар, де дисперсія значень типів ґрунту мінімальна.",
        "Знайти шар, де дисперсія значень типів ґрунту максимальна.",
        "Знайти вертикальний стовпець, де найчастіше зустрічається тип ґрунту '1' (тверда порода).",
        "Знайти середню відстань між шарами, що містять золото.",
        "Знайти кількість вертикальних стовпців, де прибуток зростає з глибиною.",
        "Знайти кількість вертикальних стовпців, де складність видобутку зростає з глибиною.",
        "Знайти шар, де максимальна кількість золота зосереджена в одному рядку.",
        "Знайти шар, де максимальна кількість золота зосереджена в одному стовпці (двовимірного шару).",
        "Знайти вертикальний стовпець, в якому немає жодного елемента 0 (м'яка порода).",
        "Знайти шар, в якому немає жодного елемента 3 (вода)."
    ],
    "LAB16": [
        [
            "x = 5*sin(2*t)+cos(tan(t+0.5))",
            "y = cos(2*t)"
        ],
        [
            "x = sin(t+pi/2)",
            "y = sin(2*t)"
        ],
        [
            "x = sin(4*t-pi/3)",
            "y = sin(9*t+pi/2)"
        ],
        [
            "x = sin(4*t-pi/3)",
            "y = cos(x*t+t)"
        ],
        [
            "x = sin(t*t+pi/2)",
            "y = cos(t)*tan(x)"
        ],
        [
            "x = sin(t+pi/2)+cos(t)",
            "y = sin(x*t/4)"
        ],
        [
            "x = sin(t+pi/2)*sinh(3*t)",
            "y = cos(5*pi*t+1.75)+cosh(2*t)"
        ],
        [
            "x = t*sin(t)",
            "y = t*cos(t)"
        ],
        [
            "x = sin(1.5*t)**3",
            "y = cos(2.3*t)**3"
        ],
        [
            "x = sin(2*t)*sin(3*t)",
            "y = sin(5*t)*sin(4*t)"
        ],
        [
            "x = 2*cos(t)+cos(2*t)",
            "y = 2*sin(t)-sin(2*t)"
        ],
        [
            "x = 2*(cos(t)+cos(5*t)/3)",
            "y = 2*(sin(t)-sin(5*t)/3)"
        ],
        [
            "x = 6.2*(cos(t)-cos(3.1*t)/3.1)",
            "y = 6.2*(sin(t)-sin(3.1*t)/3.1)"
        ],
        [
            "x = 4*sin(2*t)+2*cos(3*t)",
            "y = 2*sin(3*t)+cos(10*t)"
        ],
        [
            "x = sin(2*t*cos(t))/t",
            "y = cos(3+t)/(t*x)"
        ],
        [
            "x = cos(t*sin(t))/(t*t)",
            "y = sin(1.5*t)/t"
        ],
        [
            "x = sin(6*t)*cos(t)",
            "y = sin(6*t)*sin(t)"
        ],
        [
            "x = sin(t/2)*cos(2*t)",
            "y = sin(t*3)*sin(t/7)"
        ],
        [
            "x = 4*sin(4*t)+2*cos(5*t)",
            "y = 2*sin(3*t)+cos(10*t)"
        ],
        [
            "x = t*sin(t*3)",
            "y = t*sin(t)*cos(t*3)"
        ],
        [ 
            "x = sin(3*t + pi/2)",
            "y = sin(2*t)"
        ],
        [ 
            "x = 4*cos(t)**3",
            "y = 4*sin(t)**3"
        ],
        [ 
            "x = 2*cos(t)*(1 - cos(t))",
            "y = 2*sin(t)*(1 - cos(t))"
        ],
        [
            "x = 3*cos(t) / (1 + sin(t)**2)",
            "y = 3*sin(t)*cos(t) / (1 + sin(t)**2)"
        ],
        [ 
            "x = 2*(t - sin(t))",
            "y = 2*(1 - cos(t))"
        ],
        [
            "x = 5*cos(t) - cos(5*t)",
            "y = 5*sin(t) - sin(5*t)"
        ],
        [
            "x = 3*cos(t) + cos(3*t)",
            "y = 3*sin(t) - sin(3*t)"
        ],
        [
            "x = cos(t) + t*sin(t)",
            "y = sin(t) - t*cos(t)"
        ],
        [ 
            "x = 2*cos(t) + 3*cos(t)**2",
            "y = 2*sin(t) + 3*sin(t)*cos(t)"
        ],
        [ 
            "x = (1 - t**2) / (1 + t**2)",
            "y = t*(1 - t**2) / (1 + t**2)"
        ],
        [ 
            "x = 1/cosh(t)",
            "y = t - tanh(t)"
        ],
        [
            "x = t/tan(t)",
            "y = t"
        ],
        [
            "x = 0.5*exp(0.1*t)*cos(t)",
            "y = 0.5*exp(0.1*t)*sin(t)"
        ],
        [ 
            "x = 0.1*t*cos(t)",
            "y = 0.1*t*sin(t)"
        ],
        [ 
            "x = cos(t)/t",
            "y = sin(t)/t"
        ],
        [
            "x = cos(t)/sqrt(t)",
            "y = sin(t)/sqrt(t)"
        ],
        [ 
            "x = cos(5*t)*cos(t)",
            "y = cos(5*t)*sin(t)"
        ],
         [ 
            "x = sin(4*t)*cos(t)",
            "y = sin(4*t)*sin(t)"
        ],
        [ 
            "x = sin(t)*(exp(cos(t)) - 2*cos(4*t) - sin(t/12)**5)",
            "y = cos(t)*(exp(cos(t)) - 2*cos(4*t) - sin(t/12)**5)"
        ],
        [ 
            "x = (1 + 4*cos(t)**2)*cos(t)",
            "y = (1 + 4*cos(t)**2)*sin(t)"
        ],
        [
            "x = 2*cos(t) + cos(2*t)",
            "y = 2*sin(t) - sin(2*t)"
        ],
        [
            "x = 3*cos(t) - cos(3*t)",
            "y = 3*sin(t) - sin(3*t)"
        ],
        [ 
            "a=2; b=1.5; x = sqrt((a**2-b**2+sqrt((a**2-b**2)**2+4*b**4*cos(2*t)**2))/2)*cos(t)",
            "y = sqrt((a**2-b**2+sqrt((a**2-b**2)**2+4*b**4*cos(2*t)**2))/2)*sin(t)"
        ],
        [ 
            "x = 2*sin(t)**2 / cos(t)",
            "y = 2*sin(t)**3 / cos(t)"
        ],
        [
            "a=1; b=2; x = a/cos(t) + b*cos(t)",
            "y = a*tan(t) + b*sin(t)"
        ],
        [ 
             "a=1; x = a*(1+2*cos(t/2))*cos(t/2)",
             "y = a*(1+2*cos(t/2))*sin(t/2)"
         ],
         [
             "a=1; b=2; x = sqrt((b**2*tan(t)**2-a**2)/(tan(t)**2-1))*cos(t)",
             "y = sqrt((b**2*tan(t)**2-a**2)/(tan(t)**2-1))*sin(t)"
         ],
         [
             "a=1; b=2; x = a*t - b*sin(t)",
             "y = a - b*cos(t)"
         ],
         [ 
             "a=1; b=2; x = a*cos(t)**4 / sin(t)**2",
             "y = a*cos(t)**3 / sin(t)"
         ],
        [
            "x = sin(5*t)",
            "y = sin(4*t + pi/4)"
        ],
        [ 
            "x = cos(t)*(1+cos(t))",
            "y = sin(t)*(1+cos(t))"
        ],
        [ 
            "x = sqrt(cos(2*t))*cos(t)",
            "y = sqrt(cos(2*t))*sin(t)"
        ],
        [ 
            "a=2; b=1; x = a*t - b*sin(t)",
            "y = a - b*cos(t)"
        ],
        [ 
            "a=1; b=2; x = a*t - b*sin(t)",
            "y = a - b*cos(t)"
        ],
        [ 
             "R=5; r=1; d=0.8; x = (R+r)*cos(t) - d*cos((R+r)/r * t)",
             "y = (R+r)*sin(t) - d*sin((R+r)/r * t)"
         ],
         [ 
             "R=5; r=3; d=5; x = (R-r)*cos(t) + d*cos((R-r)/r * t)",
             "y = (R-r)*sin(t) - d*sin((R-r)/r * t)"
         ],
        [
            "k = 3/2; x = cos(k*t)*cos(t)",
            "y = cos(k*t)*sin(t)"
        ],
        [ 
            "k = 5; x = sin(k*t)*cos(t)",
            "y = sin(k*t)*sin(t)"
        ],
        [
            "a = 0.2; x = a*t*cos(t)",
            "y = a*t*sin(t)"
        ],
        [
            "a=1; b=0.1; x = a*exp(b*t)*cos(t)",
            "y = a*exp(b*t)*sin(t)"
        ],
        [ 
            "a = 3; x = a*cos(t)**3",
            "y = a*sin(t)**3"
        ],
        [
             "a=1; x = a*sin(t)",
             "y = a*cos(t)**2*(2+cos(t))/(3+sin(t)**2)"
         ],
         [
             "a=3; x = 3*a*t/(1+t**3)",
             "y = 3*a*t**2/(1+t**3)"
         ],
        [ 
            "x = cos(6*t)",
            "y = sin(5*t)"
        ],
        [
            "a=1.5; x = a*(2*cos(t) - cos(2*t))",
            "y = a*(2*sin(t) - sin(2*t))"
        ],
        [ 
            "a=2; x = a*(2*cos(t)+cos(2*t))",
            "y = a*(2*sin(t)-sin(2*t))"
        ],
        [ 
             "a=2; x = a*(3*cos(t) - cos(3*t))",
             "y = a*(3*sin(t) - sin(3*t))"
         ],
        [ 
            "x = t**2 * cos(t)",
            "y = t**2 * sin(t)"
        ],
        [ 
            "z = (t + 1j*t)**2; x = z.real",
            "y = z.imag"
        ],
         [ 
             "R=3; r=1; d=1.5; x = (R+r)*cos(t) - d*cos((R+r)/r * t)",
             "y = (R+r)*sin(t) - d*sin((R+r)/r * t)"
         ],
         [ 
             "R=8; r=5; d=3; x = (R-r)*cos(t) + d*cos((R-r)/r * t)",
             "y = (R-r)*sin(t) - d*sin((R-r)/r * t)"
         ],
        [
            "x = sin(t)",
            "y = sin(sqrt(2)*t)"
        ],
        [ 
             "k = 7/3; x = cos(k*t)*cos(t)",
             "y = cos(k*t)*sin(t)"
         ],
        [
             "a=1;b=1;m=6;n1=1;n2=7;n3=8; phi=t; r = (abs(cos(m*phi/4)/a)**n2 + abs(sin(m*phi/4)/b)**n3)**(-1/n1); x=r*cos(phi)",
             "y = r*sin(phi)"
         ],
        [ 
            "x = t**2 - 1",
            "y = t**3 - t"
        ],
        [ 
            "x = cos(t) + cos(3*t)",
            "y = sin(t) - sin(3*t)"
        ],
        [ 
             "x = t - tanh(t)",
             "y = 1/cosh(t)"
         ],
        [ 
            "x = exp(t)*cos(t)",
            "y = exp(t)*sin(t)"
        ],
        [ 
            "x = sin(t)/(1+cos(t)**2)",
            "y = sin(t)*cos(t)/(1+cos(t)**2)"
        ],
         [ 
            "x = t + sin(t)",
            "y = 1 + cos(t)"
        ],
        [
            "x = 4*cos(t)",
            "y = 3*sin(t)"
        ],
        [ 
            "x = t**2",
            "y = t**3"
        ],
        [ 
             "x = cos(2*t)",
             "y = sin(3*t)"
         ],
        [
            "x = 1/(1+t**2)",
            "y = t/(1+t**2)"
        ],
        [ 
            "x = t*cos(log(t))",
            "y = t*sin(log(t))"
        ],
        [ 
             "x = acos(t)",
             "y = sqrt(1-t**2)"
         ],
        [
            "x = tan(t)",
            "y = sin(t)*cos(t)"
        ],
        [ 
            "x = sinh(t)",
            "y = cosh(t)**2"
        ],
        [
            "x = 1 - t**2",
            "y = t*(1-t**2)"
        ],
        [ 
            "x = cos(t)**5",
            "y = sin(t)**5"
        ],
        [ 
            "x = t + 1/t",
            "y = t - 1/t"
        ],
        [
            "x = exp(-t)*cos(10*t)",
            "y = exp(-t)*sin(10*t)"
        ],
        [ 
            "x = sin(t + sin(t))",
            "y = cos(t + cos(t))"
        ],
        [ 
            "x = t - sin(t)**3",
            "y = 1 - cos(t)**3"
        ]
    ]
}
